{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "# Hello World\n",
    "\n",
    "This notebook walks through basic code examples for integrating various packages with Neo4j, including `py2neo`, `ipython-cypher`, `pandas`, `neo4jupyter`, `networkx` and `jgraph`."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "# py2neo\n",
    "\n",
    "`py2neo` is one of Neo4j's Python drivers. It offers a fully-featured interface for interacting with your data in Neo4j. Install `py2neo` with `pip install py2neo`."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "## Connect\n",
    "\n",
    "Connect to Neo4j with the `Graph` class."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "\n",
    "# If you plan to use both serenata de amor and neo4j \n",
    "# inside docker containers you need to instantiate the Graph object like this\n",
    "\n",
    "# graph = Graph('http://neo4j:7474')\n",
    "\n",
    "graph = Graph()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": true,
    "deletable": true,
    "editable": true
   },
   "outputs": [],
   "source": [
    "graph.delete_all()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "## Nodes\n",
    "\n",
    "Create nodes with the `Node` class. The first argument is the node's label. The remaining arguments are an arbitrary amount of node properties or key-value pairs."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": true,
    "deletable": true,
    "editable": true
   },
   "outputs": [],
   "source": [
    "from py2neo import Node\n",
    "\n",
    "nicole = Node(\"Person\", name=\"Nicole\", age=24)\n",
    "drew = Node(\"Person\", name=\"Drew\", age=20)\n",
    "\n",
    "mtdew = Node(\"Drink\", name=\"Mountain Dew\", calories=9000)\n",
    "cokezero = Node(\"Drink\", name=\"Coke Zero\", calories=0)\n",
    "\n",
    "coke = Node(\"Manufacturer\", name=\"Coca Cola\")\n",
    "pepsi = Node(\"Manufacturer\", name=\"Pepsi\")\n",
    "\n",
    "graph.create(nicole | drew | mtdew | cokezero | coke | pepsi)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "## Relationships\n",
    "\n",
    "Create relationships between nodes with the `Relationship` class."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [],
   "source": [
    "from py2neo import Relationship\n",
    "\n",
    "graph.create(Relationship(nicole, \"LIKES\", cokezero))\n",
    "graph.create(Relationship(nicole, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(drew, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(coke, \"MAKES\", cokezero))\n",
    "graph.create(Relationship(pepsi, \"MAKES\", mtdew))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "## Neo4jupyter\n",
    "\n",
    "First of all we need to initialize neo4jupyter in order to draw graphs."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [
    {
     "data": {
      "application/javascript": [
       "$(\"head\").append($(\"<link/>\").attr({\n",
       "  rel:  \"stylesheet\",\n",
       "  type: \"text/css\",\n",
       "  href: \"https://cdnjs.cloudflare.com/ajax/libs/vis/4.8.2/vis.css\"\n",
       "}));\n",
       "require.config({     paths: {         vis: '//cdnjs.cloudflare.com/ajax/libs/vis/4.8.2/vis.min'     } }); require(['vis'], function(vis) {  window.vis = vis; }); "
      ],
      "text/plain": [
       "<IPython.core.display.Javascript object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import neo4jupyter\n",
    "\n",
    "neo4jupyter.init_notebook_mode()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"f33acf58-b420-4662-b590-de5f42a20c94\" style=\"height: 400px;\"></div>\n",
       "\n",
       "<script type=\"text/javascript\">\n",
       "\n",
       "    var nodes = [{\"id\": 5376, \"title\": \"{'name': 'Pepsi'}\", \"group\": \"Manufacturer\", \"label\": \"Pepsi\"}, {\"id\": 5379, \"title\": \"{'calories': 9000, 'name': 'Mountain Dew'}\", \"group\": \"Drink\", \"label\": \"Mountain Dew\"}, {\"id\": 5378, \"title\": \"{'age': 20, 'name': 'Drew'}\", \"group\": \"Person\", \"label\": \"Drew\"}, {\"id\": 5374, \"title\": \"{'calories': 0, 'name': 'Coke Zero'}\", \"group\": \"Drink\", \"label\": \"Coke Zero\"}, {\"id\": 5377, \"title\": \"{'age': 24, 'name': 'Nicole'}\", \"group\": \"Person\", \"label\": \"Nicole\"}, {\"id\": 5375, \"title\": \"{'name': 'Coca Cola'}\", \"group\": \"Manufacturer\", \"label\": \"Coca Cola\"}];\n",
       "    var edges = [{\"to\": 5379, \"label\": \"MAKES\", \"from\": 5376}, {\"to\": 5379, \"label\": \"LIKES\", \"from\": 5378}, {\"to\": 5379, \"label\": \"LIKES\", \"from\": 5377}, {\"to\": 5374, \"label\": \"LIKES\", \"from\": 5377}, {\"to\": 5374, \"label\": \"MAKES\", \"from\": 5375}];\n",
       "\n",
       "    var container = document.getElementById(\"f33acf58-b420-4662-b590-de5f42a20c94\");\n",
       "\n",
       "    var data = {\n",
       "        nodes: nodes,\n",
       "        edges: edges\n",
       "    };\n",
       "\n",
       "    var options = {\n",
       "    nodes: {\n",
       "        shape: 'dot',\n",
       "        size: 25,\n",
       "        font: {\n",
       "            size: 14\n",
       "        }\n",
       "    },\n",
       "    edges: {\n",
       "        font: {\n",
       "            size: 14,\n",
       "            align: 'middle'\n",
       "        },\n",
       "        color: 'gray',\n",
       "        arrows: {\n",
       "            to: {\n",
       "                enabled: true,\n",
       "                scaleFactor: 0.5\n",
       "            }\n",
       "        },\n",
       "        smooth: {\n",
       "            enabled: false\n",
       "        }\n",
       "    },\n",
       "    physics: {\n",
       "        enabled: true\n",
       "        }\n",
       "    };\n",
       "\n",
       "    var network = new vis.Network(container, data, options);\n",
       "\n",
       "</script>\n"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from neo4jupyter import draw\n",
    "\n",
    "options = {\"Person\": \"name\", \"Drink\": \"name\", \"Manufacturer\": \"name\"}\n",
    "draw(graph, options)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "## Cypher\n",
    "\n",
    "Retrieve Cypher query results with `Graph.run`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "('name': 'Nicole', 'drink': 'Mountain Dew')\n",
      "('name': 'Nicole', 'drink': 'Coke Zero')\n",
      "('name': 'Drew', 'drink': 'Mountain Dew')\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name AS name, drink.name AS drink\n",
    "\"\"\"\n",
    "\n",
    "data = graph.run(query)\n",
    "\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "## Parameterized Cypher\n",
    "\n",
    "Pass parameters to Cypher queries by passing additional key-value arguments to `Graph.run`. Parameters in Cypher are named and are wrapped in curly braces."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "('name': 'Nicole', 'avg_calories': 4500.0)\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (p:Person)-[:LIKES]->(drink:Drink)\n",
    "WHERE p.name = {name}\n",
    "RETURN p.name AS name, AVG(drink.calories) AS avg_calories\n",
    "\"\"\"\n",
    "\n",
    "data = graph.run(query, name=\"Nicole\")\n",
    "\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "# ipython-cypher\n",
    "\n",
    "`ipython-cypher` exposes `%cypher` magic in Jupyter. Install `ipython-cypher` with `pip install ipython-cypher`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "collapsed": true,
    "deletable": true,
    "editable": true
   },
   "outputs": [],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "## Cypher\n",
    "\n",
    "`%cypher` is intended for one-line Cypher queries and `%%cypher` is intended for multi-line Cypher queries. Placing `%%cypher` above a Cypher query will display that query's results."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>person.name</th>\n",
       "        <th>drink.name</th>\n",
       "        <th>drink.calories</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Coke Zero</td>\n",
       "        <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Drew</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Nicole', 'Mountain Dew', 9000],\n",
       " ['Nicole', 'Coke Zero', 0],\n",
       " ['Drew', 'Mountain Dew', 9000]]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name, drink.name, drink.calories"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "## Pandas Data Frames\n",
    "\n",
    "Cypher query results can be coerced to `pandas` data frames with the `get_dataframe` method. To assign Cypher query results to a variable, you need to use `%cypher` and separate lines with \\\\. You'll first need to install `pandas` with `pip install pandas`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>drink</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Coke Zero</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Drew</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     name         drink\n",
       "0  Nicole  Mountain Dew\n",
       "1  Nicole     Coke Zero\n",
       "2    Drew  Mountain Dew"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = %cypher MATCH (person:Person)-[:LIKES]->(drink:Drink) \\\n",
    "                  RETURN person.name AS name, drink.name AS drink\n",
    "    \n",
    "df = results.get_dataframe()\n",
    "\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "## NetworkX Graphs\n",
    "\n",
    "Cypher query results can be coerced to `NetworkX` MultiDiGraphs, graphs that permit multiple edges between nodes, with the `get_graph` method. You'll first need to install `NetworkX` with `pip install networkx`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/marcus/anaconda/envs/serenata_de_amor/lib/python3.5/site-packages/networkx/drawing/nx_pylab.py:126: MatplotlibDeprecationWarning: pyplot.hold is deprecated.\n",
      "    Future behavior will be consistent with the long-time default:\n",
      "    plot commands add elements without first clearing the\n",
      "    Axes and/or Figure.\n",
      "  b = plt.ishold()\n",
      "/home/marcus/anaconda/envs/serenata_de_amor/lib/python3.5/site-packages/networkx/drawing/nx_pylab.py:138: MatplotlibDeprecationWarning: pyplot.hold is deprecated.\n",
      "    Future behavior will be consistent with the long-time default:\n",
      "    plot commands add elements without first clearing the\n",
      "    Axes and/or Figure.\n",
      "  plt.hold(b)\n",
      "/home/marcus/anaconda/envs/serenata_de_amor/lib/python3.5/site-packages/matplotlib/__init__.py:917: UserWarning: axes.hold is deprecated. Please remove it from your matplotlibrc and/or style files.\n",
      "  warnings.warn(self.msg_depr_set % key)\n",
      "/home/marcus/anaconda/envs/serenata_de_amor/lib/python3.5/site-packages/matplotlib/rcsetup.py:152: UserWarning: axes.hold is deprecated, will be removed in 3.0\n",
      "  warnings.warn(\"axes.hold is deprecated, will be removed in 3.0\")\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAdgAAAFCCAYAAABSJMy8AAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAHOlJREFUeJzt3XtUlWXax/HfFlQ2aMg0agfLmWbMbBLCwwwgZRqVYI3l\nRIJASDWVTk1ZHqbWat6yKctQSysr0/GAaZpmmadS0xQ2jRQItRpT32koeyfKJYwKqLD3+8eOEjHl\nsJ9978P38xc8Gx4vXEt/XPdz7/uyuVwulwAAgEe1M10AAACBiIAFAMACBCwAABYgYAEAsAABCwCA\nBQhYAAAsQMACAGABAhYAAAsQsAAAWICABQDAAgQsAAAWIGABALAAAQsAgAUIWAAALEDAAgBgAQIW\nAAALELAAAFiAgAUAwAIELAAAFiBgAQCwAAELAIAFCFgAACxAwAIAYAECFgAACxCwAABYINR0AQCC\nTEWFtGCBVFoqVVVJkZFSdLSUkyN17Wq6OsBjbC6Xy2W6CABBYOdOaepUaf169+e1tT++ZrdLLpeU\nnCw99JA0cKCZGgEPImABWG/OHGnCBKmmxh2kP8Vmc4dtbq40dqz36gMswBIxAGs1hGt19Zm/1uVy\nf92ECe7PCVn4MTpYANbZuVO66qrmhevJwsOlbdukAQM8XhbgDewiBmCdqVPdy8KtUVPj/n7AT9HB\nArBGRYXUs2fjzUwtFRYmlZezuxh+iQ4WgDUWLGj7PWw2z9wHMICABWCN0tK2da+Se5m4rMwz9QBe\nRsACsEZVlWfuc/CgZ+4DeBkBC8AakZGeuU9UlGfuA3gZAQvAGtHR7k1KbeCy26W+fT1UEOBdBCwA\na4wZ0+ZbHKut1d7ExLbXAhhAwAKwRrdu7rOFbbZWfXu9pHdcLsUkJWnevHniHYXwN7wPFoB12nCS\n0xFJgyV99P3nqampeuWVV9SlSxcPFghYhw4WgHUGDnQf3B8e3qJvqw0J0YP6MVwlacWKFYqJidGO\nHTs8WiJgFQIWgLXGjv0xZM+0XGyzSeHh6jh7tn47b57CTwrm8vJyDR48WI899pjq6uosLBpoO5aI\nAXhHUZH7bOF169xBeuIZxQ3zYFNS3PNgvz/gf/fu3UpPT1dxcXGT2yUmJiovL089e/b01k8AtAgB\nC8C7vv3WffxhWZn7EImoKPdbccaMOeWZw0ePHtXDDz+sGTNmNHktMjJSc+fOVWpqqvV1Ay1EwALw\nCxs2bFB2drYqKiqavHb77bfrueeeU0REhIHKgFMjYAH4jW+++UZjxozRhg0bmrzWu3dvLV26VLGx\nsQYqA5pikxMAv9G9e3etXbtWM2fOVIcOHRq9tnv3bsXFxWnmzJlyOp2GKgR+RAcLwC8VFxcrPT1d\nu3fvbvLasGHDtGDBAnXv3t1AZYAbHSwAvxQbG6uPPvpId9xxR5PXNmzYoOjoaG3cuNFAZYAbAQvA\nb0VERGju3LlasWJFkxOeKioqNGzYMD344IM6evSooQoRzFgiBhAQysvLlZGRccqTnmJjY7V06VL1\n7t3bQGUIVnSwAALChRdeqPfff1+PPvqo2rVr/F9bcXGx+vXrx9AAeBUdLICAs2PHDmVkZKi8vLzJ\nawwNgLfQwQIIOImJiSopKTnlCU8MDYC3ELAAAlJUVJRef/11zWNoAAxhiRhAwNu9e7fS0tJUUlLS\n5DWGBsAqdLAAAl7v3r1VWFioBx54oMlrO3bsUExMjN59910DlSGQEbAAgkLHjh01ffp0rV+/Xt26\ndWv02vHjx3XRRRcZqgyBioAFEFSGDRum0tJSDRs27IdrISEhWr58uerr6w1WhkDDM1gAQcnpdOq5\n555TWVmZHnvsMWVlZclms2nx4sXq0aOH6fIQAAhYAEHN5XLJZrOpvr5eTz31lGbNmqWXX35ZN954\no+nS4OcIWAA4gcPhUEZGhq677jpNnz69yVt8gObiGSwAnCA+Pl7FxcWqqqrSwIEDVVZWZrok+CkC\nFgBOEhkZqSVLlmjSpEkaOnSonn/+ec4wRouxRAwAp7Fnzx6NHj1a5557rubPn6+f//znpkuCn6CD\nBYDT6NWrl/Lz89WnTx9dfvnl2rx5s+mS4CfoYAGgmTZt2qTs7GxlZWVpypQp6tChg+mS4MPoYAGg\nmZKSklRSUqJPPvlEgwYN0t69e02XBB9GwAJAC3Tt2lVr1qzRrbfeqvj4eC1atIgNUDgllogBoJVK\nS0uVlpam2NhYzZkzR2eddZbpkuBD6GABoJWio6NVVFSkzp07KzY2VoWFhaZLgg+hgwUAD1i1apXG\njh2r++67T5MnT1ZISIjpkmAYAQsAHvLVV18pMzNTNptNeXl5Ov/8802XBINYIgYAD+nRo4c2b96s\npKQk9e/fX6tXrzZdEgyigwUAC5w4NGDGjBmy2+2mS4KX0cECgAVOHBowYMAAhgYEIQIWACzC0IDg\nxhIxAHjBnj17lJ6ervPOO4+hAUGCDhYAvKBXr14qKCjQJZdcwtCAIEEHCwBe9t5772nMmDHKysrS\n448/rvbt25suCRaggwUAL7vmmmsYGhAECFgAMKBhaEBWVpbi4+O1ePFi0yXBw1giBgDDGoYG9OvX\nTy+++CJDAwIEHSwAGNYwNKBTp04MDQggdLAA4EMYGhA4CFgA8DFffvmlMjMzFRISosWLFzM0wE+x\nRAwAPuaCCy7Qli1bNHToUPXr109vvfWW6ZLQCnSwAODDHA6HRo8ereTkZE2fPp2hAX6EDhYAfFh8\nfLxKSkp08OBBDRw4kKEBfoSABQAfFxkZqddee00TJ07U0KFD9cILLzA0wA+wRAwAfuTzzz/X6NGj\nGRrgB+hgAcCPXHzxxQwN8BN0sADgpxga4NvoYAHAT11zzTUqLi7+YWjAvn37TJeEExCwAODHunXr\npjVr1igzM1NxcXEMDfAhLBEDQIDYtWuX0tPTGRrgI+hgASBAxMTEqKioSBEREYqNjdWHH35ouqSg\nRgcLAAGoYWjA/fffr0mTJjE0wAACFgACFEMDzGKJGAACFEMDzKKDBYAgUFBQoIyMDIYGeBEdLAAE\ngYSEhEZDAz755BPTJQU8AhYAgkTD0IAJEyZoyJAhDA2wGEvEABCEGoYGnH/++Zo3bx5DAyxABwsA\nQahhaMDFF1+syy+/XFu2bDFdUsChgwWAIPfuu+8qJydHt956q6ZMmcLQAA+hgwWAIHfttdequLhY\npaWlDA3wIAIWAKBu3brpnXfeUUZGBkMDPIQlYgBAI7t27VJaWpr69+/P0IA2oIMFADQSExOjjz76\niKEBbUQHCwD4SStXrtS4ceMYGtAKBCwA4LQYGtA6LBEDAE6rYWjAkCFD1L9/f4YGNBMdLACg2RqG\nBqSkpCg3N5ehAadBBwsAaLaEhAQVFxfrwIEDDA04AwIWANAiXbp00dKlSxkacAYsEQMAWu3zzz9X\nenq6evTowdCAk9DBAgBa7eKLL5bD4VCvXr0YGnASOlgAgEcwNKAxOlgAgEecODQgMTEx6IcGELAA\nAI9pGBowevRoxcXFKS8vz3RJxrBEDACwRElJidLT0zVgwAC98MILQTc0gA4WAGCJyy+/XEVFRbLb\n7UE5NIAOFgBguTfeeEPjxo3T+PHjzzw0oKJCWrBAKi2VqqqkyEgpOlrKyZG6dvVazW1FwAIAvKK8\nvFyZmZkKDQ099dCAnTulqVOl9evdn9fW/via3S65XFJysvTQQ9LAgd4rvJVYIgYAeMWFF16o999/\n/9RDA+bMka66Slq92h2sJ4arJNXUuK+tXu3+ujlzvFl6q9DBAgC87sShATN791aHhx6Sqqubf4Pw\ncCk3Vxo71roi24iABQAYUVlZqWmpqXpk82bZWxNF4eHStm3SgAGeL84DWCIGABjRpUsXPdGpkzq2\n9gY1Ne5ntj6KDhYAYEZFhdSzZ9PnrS0RFiaVl/vk7mI6WACAGQsWtP0eNptn7mMBAhYAYEZpadu6\nV8m9TFxW5pl6PIyABQCYUVXlmfscPOiZ+3gYAQsAMCMy0jP3iYryzH08jIAFAJgRHe3epNQWdrvU\nt69n6vEwdhEDAMxgFzEAABbo1k1KTpbTZmvd99tsUkqKT4arRMACAAxaGx2t2tYupNrt7oP/fRQB\nCwDwOpfLpSlTpuiehQtV+cgj7mMPW6LhLGIfPSZRkkJNFwAACC7Hjh3TnXfeqU8//VQOh0PnnHOO\ndO650oQJ7ve1nq6jtdncnauPH/Qv0cECALyosrJSycnJqqys1NatW93hKrnDcts26aab3BuX7PbG\n32i3u6/fdJP763w8XCV2EQMAvOTf//63UlJSlJSUpBkzZigkJOTUX/jtt+7jD8vK3IdIREW534oz\nZozPbmg6FQIWAGC5oqIijRgxQpMmTdJ9991nuhyv4BksAMBSa9as0W233aa5c+fqxhtvNF2O1xCw\nAADLPP/883ryySe1du1a/fa3vzVdjlcRsAAAj6uvr9fEiRO1fv165efn65e//KXpkryOgAUAeFR1\ndbUyMzN18OBBFRQUKMpHD+O3Gm/TAQB4TEVFhYYMGaKIiAht2LAhaMNVImABAB7yz3/+U/Hx8Ro2\nbJgWLVqkjh07mi7JKJaIAQBttm3bNt1yyy16+umnNWbMGNPl+AQCFgDQJkuWLNH48eO1dOlSXX31\n1abL8RkELACgVVwul5544gm9+uqr2rJliy677DLTJfkUAhYA0GLHjx/X3XffrZKSEjkcDp177rmm\nS/I5BCwAoEWqqqp08803KywsTNu2bVOnTp1Ml+ST2EUMAGi28vJyJSYmqnfv3lq9ejXhehoELACg\nWT7++GMlJCTotttu0+zZs396Gg4ksUQMAGiGtWvXKicnRy+99JJGjhxpuhy/QMACAE7rxRdf1OOP\nP663335bcXFxpsvxGwQsAOCUnE6nJk+erLfffls7duzQr371K9Ml+RUCFgDQRE1NjbKyslRRUSGH\nw6Gf/exnpkvyO2xyAgA08u2332ro0KHq2LGj3nvvPcK1lQhYAMAPPv/8c8XHxyspKUl5eXlBf2B/\nW7BEDACQJG3fvl2pqal64okndPvtt5sux+8RsAAALVu2TH/+85+Vl5ena6+91nQ5AYGABYAg5nK5\n9PTTT2vOnDnavHmz+vbta7qkgEHAAkCQOn78uMaNG6eioiI5HA6dd955pksKKAQsAASh//73v0pN\nTVVoaKg++OADde7c2XRJAYddxAAQZL766islJibqoosu0ltvvUW4WoSABYAgUlJSovj4eGVlZenF\nF19UaCgLmVbhbxYAgsT69euVnZ2tF154QampqabLCXh0sAAQBF555RXddtttWr16NeHqJXSwABDA\nnE6nHn74Ya1atUrbt2/Xr3/9a9MlBQ0CFgACVG1trbKzs7V//345HA6dffbZpksKKiwRA0AA+u67\n75SUlCSbzaZNmzYRrgYQsAAQYPbs2aP4+HhdccUVeu211xQWFma6pKBEwAJAAMnPz9cVV1yhSZMm\naerUqWrXjv/mTeEZLAAEiOXLl+uee+7R4sWLdd1115kuJ+gRsADg51wul5555hnNnj1b7733nmJi\nYkyXBBGwAODX6urqdO+996qgoEAOh0M9evQwXRK+R8ACgJ86dOiQRo0aJafTqe3bt+uss84yXRJO\nwNNvAPBD+/fv15VXXqkePXpozZo1hKsPImABwM+UlpYqPj5eaWlpevnll9W+fXvTJeEUWCIGAD+y\nceNGZWVlafbs2Ro1apTpcnAadLAA4CdeffVVZWdna9WqVYSrH6CDBQAf53Q69cgjj2j58uXavn27\nevXqZbokNAMBCwA+7OjRo8rJydEXX3yhgoICde3a1XRJaCaWiAHARx04cEDXXHON6urqtHnzZsLV\nzxCwAOCD9u3bp4SEBMXFxWnZsmWy2+2mS0ILEbAA4GMKCwuVmJio+++/X9OmTePAfj/FM1gA8CEr\nV67U3XffrYULFyolJcV0OWgDAhYAfIDL5dKMGTM0c+ZMvfvuu4qNjTVdEtqIgAUAw+rq6nTfffdp\n+/btcjgcuuCCC0yXBA8gYAHAoMOHDystLU3Hjh3Tjh07OFM4gPDkHAAM+frrr3XllVfqnHPO0dq1\nawnXAEPAAoABn3zyiRISEnTzzTdr7ty5HNgfgFgiBgAv27Rpk0aPHq1nn31Wo0ePNl0OLEIHCwBe\n9Pe//10ZGRl64403CNcARwcLAF7gcrn017/+Va+99po++OAD9e7d23RJsBgBCwAWO3r0qG6//Xbt\n3btXDodD3bp1M10SvIAlYgCw0MGDB3XdddeppqZG77//PuEaRAhYALDIv/71LyUkJGjAgAFasWIF\nB/YHGQIWACzwj3/8Q4MGDdI999yj3NxcDuwPQjyDBQAPe/PNN3XXXXdp/vz5uv76602XA0MIWADw\noGeffVbPPPOM1q9fr/79+5suBwYRsADgAfX19Ro/fry2bNmigoIC9ezZ03RJMIyABYA2OnLkiNLT\n01VdXa38/HxFRkaaLgk+gKfuANAG//nPfzR48GCdffbZWrduHeGKHxCwANBKn376qeLi4jRixAjN\nnz9fHTp0MF0SfAhLxADQClu2bFFaWppmzJihzMxM0+XAB9HBAkALLVq0SOnp6Vq+fDnhip9EBwsA\nzeRyuTRlyhQtXLhQW7duVZ8+fUyXBB9GwAJAMxw7dkx//OMf9dlnn8nhcKh79+6mS4KPI2AB4Awq\nKys1cuRIRUZGauvWrQoPDzddEvwAz2AB4DS++OILJSQkKCYmRm+88QbhimYjYAHgJxQVFWnQoEG6\n++67NXPmTIWEhJguCX6EJWIAOIW3335bd9xxh+bOnasRI0aYLgd+iIAFgJPMnj1bTz31lNauXauB\nAweaLgd+ioAFgO/V19drwoQJ2rhxo/Lz8/WLX/zCdEnwYwQsAEiqrq5WRkaGKisrlZ+fr6ioKNMl\nwc+xyQlA0Pvmm280ZMgQde7cWRs3biRc4REELICg9tlnnyk+Pl4pKSlauHAhB/bDY1giBhC0tm7d\nqlGjRmnatGnKzs42XQ4CDAELICjl5eXpwQcf1NKlSzV06FDT5SAAEbAAgorL5dLf/vY3zZs3T1u2\nbNFvfvMb0yUhQBGwAILG8ePHddddd6m0tFSFhYU655xzTJeEAEbAAggKVVVVuvnmm2W327Vt2zZF\nRESYLgkBjl3EAAJeeXm5Bg0apD59+ujNN98kXOEVBCyAgPTVV19Jkj7++GMlJCTojjvu0KxZsziw\nH15DwAIIKE6nU5MnT1afPn00a9YsDRs2TLNnz9b9999vujQEGZvL5XKZLgIAPKGmpkbZ2dlasWKF\nJKldu3ZavXq1brjhBsOVIRgRsAACwnfffacRI0aooKCg0fW4uDgVFBTIZrMZqgzBil3EAPzenj17\nlJKSor179za63r17d82aNYtwhRE8gwXg1/Lz8xUfH98kXPv06aPCwkLmucIYAhaA33r99dd19dVX\n68CBA42uDxkyRAUFBcxzhVEELAC/43K59PTTTystLU1Hjx5t9Nqtt96qDRs2qEuXLoaqA9wIWAB+\npa6uTmPHjtVf/vKXJq89+uijWrBgASPn4BPY5ATAbxw6dEi33HKLNmzY0Oh6aGioXn31VUbOwacQ\nsAD8wv79+zV8+HDt2rWr0fXIyEitWrWKkXPwOQQsAJ+3a9cuDR8+XPv37290vWfPnlq3bp0uvfRS\nQ5UBP41nsAB82saNG5WYmNgkXAcMGKDCwkLCFT6LgAXgs+bOnavhw4fr8OHDja7//ve/19atW5nn\nCp9GwALwOU6nUw8//LDuvPNO1dfXN3rt3nvv1apVqxg5B5/HM1gAPqW2tlY5OTlatmxZo+s2m00z\nZsxgKg78BgELwGccOHBAN954o3bs2NHout1u15IlS3TTTTcZqgxoOQIWgE/Yt2+fkpOTtWfPnkbX\nu3btqjVr1uh3v/udocqA1uEZLADjHA6H4uLimoTrJZdcosLCQsIVfomABWDUypUrNXToUH333XeN\nrg8ePFgFBQW66KKLDFUGtA0BC8AIl8ul3Nxcpaamqra2ttFrmZmZ2rhxo6KiogxVB7QdAQvA6+rq\n6vSnP/1JEydOlMvlavTaI488okWLFqljx46GqgM8g01OALzq8OHDGjVqlNatW9foemhoqF555RXl\n5OQYqgzwLAIWgNd8/fXXuv7661VcXNzo+llnnaWVK1cqKSnJUGWA5xGwALyirKxMw4cP15dfftno\n+gUXXKB169bpsssuM1QZYA2ewQKw3KZNm5SYmNgkXPv166cPP/yQcEVAooMF0HoVFdKCBVJpqVRV\nJUVGStHRUk6O1LWrJGn+/Pm66667VFdX1+hbhw8frmXLlqlTp04GCgesZ3OdvIUPAM5k505p6lRp\n/Xr35ye+zcZul1wuuZKT9XJUlMbOn9/k28eNG6fnnntOoaH8jo/ARcACaJk5c6QJE6SaGuk0/304\nJdVIelDSy99fs9lsys3N1fjx42Wz2bxQLGAOvz4CaL6GcK2uPuOXtpMUIWn6958vDAtTXl6e/vCH\nP1hZIeAz6GABNM/OndJVVzUrXE9WLWnf/Pnqy3tcEUTYRQygeaZOdS8Lt4LdZlPfd97xcEGAb6OD\nBXBaLpdLNf/+t+yXXCLb0aOtv1FYmFRe/sPuYiDQ8QwWCDBOp1NHjhzR4cOHdejQIR06dKjNHz/g\ndOoxSeFtKcxmc7+lZ+JEz/yggI8jYAHD6uvrPRqGhw8f9niN0WpjuEru5eWyMg9UA/gHAhYw5IEH\nHtBLL72kmlY+1/SmLp660cGDnroT4PMIWKlZp9EALVVXV/dDd3mqjnPXrl1+Ea6SdKhdO8npbPuN\nmO+KIBLcAXu602hWrZL+53+k5GTpoYekgQPN1AivOXbsmEeWaBs+PnbsmDp16qTOnTurc+fOTT6u\nrKy07GcJDw//4c87XQ3N/bj9zJnufw8nDUZvEbtd6tvXcz8k4OOCdxdxM0+jkc3m/o8hN1caO9Z7\n9eG0XC6XamtrPfrs0ul0tjmITvzYbref9rSiadOmafLkyZLkkT+v4eNOnTopJCTEs3/hFRVSz55t\nC1h2ESPIBGfAtuA0mh+EhxOybeByudq0s/VU10JDQz0Whp07d1aHDh28enxfdXW1nE6nwsPD1a6d\nH7wlfeRIafXq0/9C+lNsNummm6SVKz1fF+Cjgi9g23AajcLDpW3bpAEDPF6Wr6mvr9eRI0c81h0e\nOXJEYWFhHu3U2rdvb/qvKbjwbwdokeAL2AD9Lbyurs5jYXjo0CHV1NQoIiLCt5ct4X2s/gDNFlwB\n6yPPkVwu1w8balq7PHryx8ePH/fo80O/WbaE97F/AWiW4NpFvGBBm2/hlPR/Tz6p/x05sk2dos1m\na3bode/e/YxfExYWxvgveMfYse5d9VOnSuvWuYP0xLcbfT8PVikp7h34LAsjSAVXB5uZKS1Z0ubb\nrOnSRU9demmbusSOHTt64AcCDPv2W/cvrmVl7kMkoqLcb8UZM4bdwgh6wRWwN9wgeWKix/XXS2vW\ntP0+AICAFVwP2SIjPXMfTqMBAJxBcAVsdLR7k1JbcBoNAKAZgmuJ2Ed2EQMAAl9wdbDdurnPFm7t\nblubzb0zknAFAJxBcHWwEqfRAAC8Irg6WMn9/r3cXHdYtkTDaTSEKwCgGYLroIkGDafKcBoNAMAi\nwbdEfKKiIk6jAQBYIrgDtgGn0QAAPIyABQDAAsG3yQkAAC8gYAEAsAABCwCABQhYAAAsQMACAGAB\nAhYAAAsQsAAAWICABQDAAgQsAAAWIGABALAAAQsAgAUIWAAALEDAAgBgAQIWAAALELAAAFiAgAUA\nwAIELAAAFiBgAQCwAAELAIAFCFgAACxAwAIAYAECFgAACxCwAABYgIAFAMACBCwAABYgYAEAsAAB\nCwCABQhYAAAsQMACAGABAhYAAAsQsAAAWICABQDAAgQsAAAWIGABALAAAQsAgAUIWAAALEDAAgBg\nAQIWAAAL/D+skkr+drdIBgAAAABJRU5ErkJggg==\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x7f7a3b0f12e8>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import networkx as nx\n",
    "%matplotlib inline\n",
    "\n",
    "results = %cypher MATCH p = (:Person)-[:LIKES]->(:Drink) RETURN p\n",
    "\n",
    "g = results.get_graph()\n",
    "\n",
    "nx.draw(g)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('5337', {'age': 20, 'labels': ['Person'], 'name': 'Drew'}),\n",
       " ('5339', {'calories': 9000, 'labels': ['Drink'], 'name': 'Mountain Dew'}),\n",
       " ('5338', {'age': 24, 'labels': ['Person'], 'name': 'Nicole'}),\n",
       " ('5340', {'calories': 0, 'labels': ['Drink'], 'name': 'Coke Zero'})]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.nodes(data=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'5337': 1, '5338': 2, '5339': 2, '5340': 1}"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nx.degree(g)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "# jgraph\n",
    "\n",
    "`jgraph` will plot tuple lists as 3D graphs."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"graph-33bb637a-fe12-4d31-98c1-098e6ebfcddb\"></div>\n",
       "           <script type=\"text/javascript\">\n",
       "           require.config({baseUrl: '/',\n",
       "                             paths: {jgraph: ['nbextensions/jgraph.min', 'https://rawgit.com/patrickfuller/jgraph/master/js/build/jgraph.min']}});\n",
       "           require(['jgraph'], function () {\n",
       "               var $d = $('#graph-33bb637a-fe12-4d31-98c1-098e6ebfcddb');\n",
       "               $d.width(600); $d.height(400);\n",
       "               $d.jgraph = jQuery.extend({}, jgraph);\n",
       "               $d.jgraph.create($d, {nodeSize: 2.000000,\n",
       "                                     edgeSize: 0.250000,\n",
       "                                     defaultNodeColor: '0x5bc0de',\n",
       "                                     defaultEdgeColor: '0xaaaaaa',\n",
       "                                     shader: 'basic',\n",
       "                                     z: 100,\n",
       "                                     runOptimization: true,\n",
       "                                     directed: true,\n",
       "                                     showSave: false});\n",
       "               $d.jgraph.draw({\n",
       "    \"edges\": [\n",
       "        { \"source\": 1, \"target\": 2 },\n",
       "        { \"source\": 2, \"target\": 3 },\n",
       "        { \"source\": 3, \"target\": 4 },\n",
       "        { \"source\": 4, \"target\": 1 },\n",
       "        { \"source\": 4, \"target\": 5 },\n",
       "        { \"source\": 5, \"target\": 2 }\n",
       "    ],\n",
       "    \"nodes\": {\n",
       "        \"1\": { \"location\": [ -2.0, -2.0, -2.0 ] },\n",
       "        \"2\": { \"location\": [ -0.9461516086599593, -0.7194854432857765, -1.3992006385676505 ] },\n",
       "        \"3\": { \"location\": [ -0.18125179724996496, -0.18198768289523493, 0.3189414737029518 ] },\n",
       "        \"4\": { \"location\": [ 1.1329805146193213, 1.1756159218463949, 1.4723647359884806 ] },\n",
       "        \"5\": { \"location\": [ 2.0, 2.0, 1.9975328459996018 ] }\n",
       "    }\n",
       "});\n",
       "\n",
       "               $d.resizable({\n",
       "                   aspectRatio: 600 / 400,\n",
       "                   resize: function (evt, ui) {\n",
       "                       $d.jgraph.renderer.setSize(ui.size.width,\n",
       "                                                  ui.size.height);\n",
       "                   }\n",
       "               });\n",
       "           });\n",
       "           </script>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import jgraph\n",
    "\n",
    "jgraph.draw([(1, 2), (2, 3), (3, 4), (4, 1), (4, 5), (5, 2)])"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python [conda env:serenata_de_amor]",
   "language": "python",
   "name": "conda-env-serenata_de_amor-py"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.5.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
