{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "# Hello World\n",
    "\n",
    "This notebook walks through basic code examples for integrating various packages with Neo4j, including `py2neo`, `ipython-cypher`, `pandas`, `neo4jupyter`, `networkx` and `jgraph`."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "# py2neo\n",
    "\n",
    "`py2neo` is one of Neo4j's Python drivers. It offers a fully-featured interface for interacting with your data in Neo4j. Install `py2neo` with `pip install py2neo`."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "## Connect\n",
    "\n",
    "Connect to Neo4j with the `Graph` class."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": true,
    "deletable": true,
    "editable": true
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "\n",
    "graph = Graph()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": true,
    "deletable": true,
    "editable": true
   },
   "outputs": [],
   "source": [
    "graph.delete_all()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "## Nodes\n",
    "\n",
    "Create nodes with the `Node` class. The first argument is the node's label. The remaining arguments are an arbitrary amount of node properties or key-value pairs."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": true,
    "deletable": true,
    "editable": true
   },
   "outputs": [],
   "source": [
    "from py2neo import Node\n",
    "\n",
    "nicole = Node(\"Person\", name=\"Nicole\", age=24)\n",
    "drew = Node(\"Person\", name=\"Drew\", age=20)\n",
    "\n",
    "mtdew = Node(\"Drink\", name=\"Mountain Dew\", calories=9000)\n",
    "cokezero = Node(\"Drink\", name=\"Coke Zero\", calories=0)\n",
    "\n",
    "coke = Node(\"Manufacturer\", name=\"Coca Cola\")\n",
    "pepsi = Node(\"Manufacturer\", name=\"Pepsi\")\n",
    "\n",
    "graph.create(nicole | drew | mtdew | cokezero | coke | pepsi)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "## Relationships\n",
    "\n",
    "Create relationships between nodes with the `Relationship` class."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [],
   "source": [
    "from py2neo import Relationship\n",
    "\n",
    "graph.create(Relationship(nicole, \"LIKES\", cokezero))\n",
    "graph.create(Relationship(nicole, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(drew, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(coke, \"MAKES\", cokezero))\n",
    "graph.create(Relationship(pepsi, \"MAKES\", mtdew))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "## Neo4jupyter\n",
    "\n",
    "First of all we need to initialize neo4jupyter in order to draw graphs."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [
    {
     "data": {
      "application/javascript": [
       "$(\"head\").append($(\"<link/>\").attr({\n",
       "  rel:  \"stylesheet\",\n",
       "  type: \"text/css\",\n",
       "  href: \"https://cdnjs.cloudflare.com/ajax/libs/vis/4.8.2/vis.css\"\n",
       "}));\n",
       "require.config({     paths: {         vis: '//cdnjs.cloudflare.com/ajax/libs/vis/4.8.2/vis.min'     } }); require(['vis'], function(vis) {  window.vis = vis; }); "
      ],
      "text/plain": [
       "<IPython.core.display.Javascript object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import neo4jupyter\n",
    "\n",
    "neo4jupyter.init_notebook_mode()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"c20eb17b-c87e-425d-bc91-91fc593c60c6\" style=\"height: 400px;\"></div>\n",
       "\n",
       "<script type=\"text/javascript\">\n",
       "\n",
       "    var nodes = [{\"id\": 5339, \"title\": \"{'name': 'Mountain Dew', 'calories': 9000}\", \"group\": \"Drink\", \"label\": \"Mountain Dew\"}, {\"id\": 5340, \"title\": \"{'name': 'Coke Zero', 'calories': 0}\", \"group\": \"Drink\", \"label\": \"Coke Zero\"}, {\"id\": 5341, \"title\": \"{'name': 'Coca Cola'}\", \"group\": \"Manufacturer\", \"label\": \"Coca Cola\"}, {\"id\": 5336, \"title\": \"{'name': 'Pepsi'}\", \"group\": \"Manufacturer\", \"label\": \"Pepsi\"}, {\"id\": 5338, \"title\": \"{'name': 'Nicole', 'age': 24}\", \"group\": \"Person\", \"label\": \"Nicole\"}, {\"id\": 5337, \"title\": \"{'name': 'Drew', 'age': 20}\", \"group\": \"Person\", \"label\": \"Drew\"}];\n",
       "    var edges = [{\"label\": \"MAKES\", \"to\": 5340, \"from\": 5341}, {\"label\": \"MAKES\", \"to\": 5339, \"from\": 5336}, {\"label\": \"LIKES\", \"to\": 5339, \"from\": 5338}, {\"label\": \"LIKES\", \"to\": 5340, \"from\": 5338}, {\"label\": \"LIKES\", \"to\": 5339, \"from\": 5337}];\n",
       "\n",
       "    var container = document.getElementById(\"c20eb17b-c87e-425d-bc91-91fc593c60c6\");\n",
       "\n",
       "    var data = {\n",
       "        nodes: nodes,\n",
       "        edges: edges\n",
       "    };\n",
       "\n",
       "    var options = {\n",
       "    nodes: {\n",
       "        shape: 'dot',\n",
       "        size: 25,\n",
       "        font: {\n",
       "            size: 14\n",
       "        }\n",
       "    },\n",
       "    edges: {\n",
       "        font: {\n",
       "            size: 14,\n",
       "            align: 'middle'\n",
       "        },\n",
       "        color: 'gray',\n",
       "        arrows: {\n",
       "            to: {\n",
       "                enabled: true,\n",
       "                scaleFactor: 0.5\n",
       "            }\n",
       "        },\n",
       "        smooth: {\n",
       "            enabled: false\n",
       "        }\n",
       "    },\n",
       "    physics: {\n",
       "        enabled: true\n",
       "        }\n",
       "    };\n",
       "\n",
       "    var network = new vis.Network(container, data, options);\n",
       "\n",
       "</script>\n"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from neo4jupyter import draw\n",
    "\n",
    "options = {\"Person\": \"name\", \"Drink\": \"name\", \"Manufacturer\": \"name\"}\n",
    "draw(graph, options)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "## Cypher\n",
    "\n",
    "Retrieve Cypher query results with `Graph.run`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "('name': 'Drew', 'drink': 'Mountain Dew')\n",
      "('name': 'Nicole', 'drink': 'Mountain Dew')\n",
      "('name': 'Nicole', 'drink': 'Coke Zero')\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name AS name, drink.name AS drink\n",
    "\"\"\"\n",
    "\n",
    "data = graph.run(query)\n",
    "\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "## Parameterized Cypher\n",
    "\n",
    "Pass parameters to Cypher queries by passing additional key-value arguments to `Graph.run`. Parameters in Cypher are named and are wrapped in curly braces."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "('name': 'Nicole', 'avg_calories': 4500.0)\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (p:Person)-[:LIKES]->(drink:Drink)\n",
    "WHERE p.name = {name}\n",
    "RETURN p.name AS name, AVG(drink.calories) AS avg_calories\n",
    "\"\"\"\n",
    "\n",
    "data = graph.run(query, name=\"Nicole\")\n",
    "\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "# ipython-cypher\n",
    "\n",
    "`ipython-cypher` exposes `%cypher` magic in Jupyter. Install `ipython-cypher` with `pip install ipython-cypher`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "collapsed": true,
    "deletable": true,
    "editable": true
   },
   "outputs": [],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "## Cypher\n",
    "\n",
    "`%cypher` is intended for one-line Cypher queries and `%%cypher` is intended for multi-line Cypher queries. Placing `%%cypher` above a Cypher query will display that query's results."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>person.name</th>\n",
       "        <th>drink.name</th>\n",
       "        <th>drink.calories</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Drew</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Coke Zero</td>\n",
       "        <td>0</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Drew', 'Mountain Dew', 9000],\n",
       " ['Nicole', 'Mountain Dew', 9000],\n",
       " ['Nicole', 'Coke Zero', 0]]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name, drink.name, drink.calories"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "## Pandas Data Frames\n",
    "\n",
    "Cypher query results can be coerced to `pandas` data frames with the `get_dataframe` method. To assign Cypher query results to a variable, you need to use `%cypher` and separate lines with \\\\. You'll first need to install `pandas` with `pip install pandas`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>drink</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Drew</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Coke Zero</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     name         drink\n",
       "0    Drew  Mountain Dew\n",
       "1  Nicole  Mountain Dew\n",
       "2  Nicole     Coke Zero"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = %cypher MATCH (person:Person)-[:LIKES]->(drink:Drink) \\\n",
    "                  RETURN person.name AS name, drink.name AS drink\n",
    "    \n",
    "df = results.get_dataframe()\n",
    "\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "## NetworkX Graphs\n",
    "\n",
    "Cypher query results can be coerced to `NetworkX` MultiDiGraphs, graphs that permit multiple edges between nodes, with the `get_graph` method. You'll first need to install `NetworkX` with `pip install networkx`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/marcus/anaconda/envs/serenata_de_amor/lib/python3.5/site-packages/networkx/drawing/nx_pylab.py:126: MatplotlibDeprecationWarning: pyplot.hold is deprecated.\n",
      "    Future behavior will be consistent with the long-time default:\n",
      "    plot commands add elements without first clearing the\n",
      "    Axes and/or Figure.\n",
      "  b = plt.ishold()\n",
      "/home/marcus/anaconda/envs/serenata_de_amor/lib/python3.5/site-packages/networkx/drawing/nx_pylab.py:138: MatplotlibDeprecationWarning: pyplot.hold is deprecated.\n",
      "    Future behavior will be consistent with the long-time default:\n",
      "    plot commands add elements without first clearing the\n",
      "    Axes and/or Figure.\n",
      "  plt.hold(b)\n",
      "/home/marcus/anaconda/envs/serenata_de_amor/lib/python3.5/site-packages/matplotlib/__init__.py:917: UserWarning: axes.hold is deprecated. Please remove it from your matplotlibrc and/or style files.\n",
      "  warnings.warn(self.msg_depr_set % key)\n",
      "/home/marcus/anaconda/envs/serenata_de_amor/lib/python3.5/site-packages/matplotlib/rcsetup.py:152: UserWarning: axes.hold is deprecated, will be removed in 3.0\n",
      "  warnings.warn(\"axes.hold is deprecated, will be removed in 3.0\")\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAd0AAAFCCAYAAAC0DQf4AAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAGepJREFUeJzt3UtQVOndx/FfQ4MNjSIqKOogXqKOFxgc7p3JkMpKU6lk\nZpG3skk5iyzcvKlKmVTNItlalXI/lR3LbPLWJFUZN6kUmEJE8AIIeINxcHQU5KICzaW7z7vo0OMR\nhb6cPqe7z/dTRZWUcPg7Y81v/s/zP8/jMQzDEAAASLs8pwsAAMAtCF0AAGxC6AIAYBNCFwAAmxC6\nAADYhNAFAMAmhC4AADYhdAEAsAmhCwCATQhdAABsQugCAGATQhcAAJsQugAA2ITQBQDAJoQuAAA2\nIXQBALAJoQsAgE0IXQAAbELoAgBgE0IXAACbELoAANiE0AUAwCaELgAANiF0AQCwCaELAIBNvE4X\nkJUmJqT2dmlgQHrxQiotlWpqpM8+k8rLna4OAJChPIZhGE4XkTV6e6ULF6RLl6KfLy5+/3tFRZJh\nSKdPS59/LjU0OFMjACBjEbrx+uIL6fx5KRiMhuu7eDzRAL54UTp3zr76AAAZj+XleKwG7sLCxl9r\nGNGvO38++jnBCwD4LzrdjfT2Sm1t8QXum4qLpc5Oqb7e8rIAANmH6eWNXLgQXVJORjAY/X4AAESn\nu76JCWnfPvPAVKJ8Pml8nKlmAAB7uutqb0/5EYtLS2pvadGl48e1efPmhD82bdokj8eT+p8FAOA4\nQnc9AwOpdbmSfIah4tFR/WN0NKnv93q9SYX16seWLVtivy4pKZHXy79yAHAK/wVez4sXljxmawrf\nGwqFNDMzo5mZGUtqKSoqSinEX//w+/104QCQAEJ3PaWlljxm1pKnWCMYDCoYDGpiYiLlZ3k8HpWU\nlGzYYSeylA4AuYzQXU9NjfS3v6W0xBzetEnNv/61/u/0ab169Squj5cvX8Z+HQqFLPwDWcswjFid\nVigoKIgF8J///Gf98pe/tOS5AJApmF5ej8PTy4ZhaGlpKe6w3uhjbm5O2fKv+7e//a1++tOfvrUj\nZl8aQLYidDfy6afSl1+uf/Tju3g80iefRLvlDBCJRLSwsBBXhx3Px2KKQ2braWpqUklJyVt/bmFh\noaX70nl5vK4OwB6E7kY4keqdVlZWNDc3l3IHvhr24XA49ux///vf+vGPf7zmZxqGoWAwaMn/NLx6\n9UrBYFB+vz/hSXBe8QKQDEI3HomcvbyquJhLDxJgGIYWFxdjYVhZWani4uK0/9xwOGzJ/zisfkQi\nEcu6cJbSgdxD6MaLW4YQh+Xl5ZS779f34N+1lJ7MdDiveAHOI3QT0dcXPUv5q6+i4fr6mcyr9+me\nORO9TzdHl5RhH8Mw1t2DT/RjcXEx7qX0eF/xIsSRFhMT0RMBBwai5yWUlkbfJvnss6w/UpfQTcbk\nZPQvxOCgNDMjlZVJJ09KZ89m/V8I5K5QKGTpUrphGJZ04Ksf+fn5Tv8jgtN6e6ONzaVL0c9fH9Zc\nbWxOn442Ng0NztSYIkIXQFKseJ1tdfl9fn5emzZtsnQqnS48y7hkC4/QBeA4wzA0Pz9vWRe+tLQk\nv9+fUuf95lI60shFw6qELoCck+pS+psDcB6Px5Lw3rJli0pKSlhKf53LXsskdAFgHVafDDc/Py+f\nz2fZUnpxcXF2L6Xn0AFE8SB0AcBGG50MF0/n/frH8vLyOy8eSaQDX/11YWGhff8wHD5q1wm8eQ8A\nNsrLy1NJSYlKSkpUWVmZ8vNCoVDc4f3s2bMNvyYvL8+yLnzDpfT29pT//PJ4os/5/e9Tf5YNCF0A\nyGJer1dlZWUqKytL+VmJLKU/f/5cX3/99YZL6evd4f3bvj41p3qGezAYfX0zSxC6AABJ0TuyfT6f\nfD6fyi1Yro1EIutOpe8aGrKgakXPS8gShC4AIC1eX6p+q0uXrOlSLejy7cKdZgAAZ9TURAehUlFU\nFD0RMEswvQwAcIYLp5fpdAEAzqioiJ6lnOx7xh5P9JKZLAlciU4XAOAkl51IRacLAHBOQ0P0DOXi\n4sS+b/Xs5SwKXInpZQCA01YvLXDBLUN0ugAA5507J3V2KvKLX2hRUuTNqeaioujQ1CefRJeUszBw\nJfZ0AQAZ5Pr16/rfX/1KXb/5TfQd3pmZ6Hu4J09KZ89m1dDU27C8DADIGJ2dnar5yU+y5izlRLG8\nDADIGJ2dnfr444+dLiNtWF4GAGSEcDisHTt2aHh42JIbmDIRnS4AICMMDg6qoqIiZwNXInQBABki\n15eWJUIXAJAh3BC67OkCABwXiURUXl6u/v5+7d271+ly0oZOFwDguKGhIZWVleV04EqELgAgA7hh\naVkidAEAGcAtocueLgDAUYZhaOfOnert7dW+ffucLiet6HQBAI4aGRmR3+/P+cCVCF0AgMPcsrQs\nEboAAIe5KXTZ0wUAOMYwDO3evVtdXV06cOCA0+WkHZ0uAMAx9+/fl9fr1f79+50uxRaELgDAMR0d\nHWpra5PH43G6FFsQugAAx7hpP1cidAEADjEMg9AFAMAOY2NjikQiOnTokNOl2IbQBQA4oqOjQx9/\n/LFr9nMlQhcA4JDOzk61tbU5XYatCF0AgCPctp8rEboAAAc8fPhQS0tLOnLkiNOl2IrQBQDYrrOz\nUz/60Y9ctZ8rEboAAAesHorhNoQuAMB2btzPlQhdAIDNHj16pFevXunYsWNOl2I7QhcAYCu37udK\nhC4AwGZuXVqWCF0AgM3cOkQlEboAABs9efJE09PTOnHihNOlOILQBQDYprOzUx999JHy8twZP+78\nUwMAHOHm/VyJ0AUA2MjN+7mS5DEMw3C6CABA7nv69Knef/99PX/+XPn5+U6X4wg6XQCALS5fvqwf\n/vCHrg1cidAFANjE7fu5EqELALAJocueLgDABpOTkzp06JCmpqbk9XqdLscxdLoAgLS7fPmyAoGA\nqwNXInQBADZgaTmK0AUApB2hG8WeLgAgraanp1VdXa2pqSkVFBQ4XY6j6HQBAGl1+fJltbS0uD5w\nJUIXAJBmLC1/j9AFAKQVofs99nQBAGkzOzur9957T1NTUyosLHS6HMfR6QIA0uY///mPmpqaCNz/\nInQBAGnD0rIZoQsASBtC14w9XQBAWrx8+VK7d+/W8+fP5fP5nC4nI9DpAgDSoqurS/X19QTuawhd\nAEBadHR0qK2tzekyMgqhCwBIC/Zz12JPFwBgubm5Oe3atUuTk5MqKipyupyMQacLALDclStXVFdX\nR+C+gdAFAFiOpeW3I3QBAJZjiOrt2NMFAFhqYWFB5eXlmpiYkN/vd7qcjEKnCwCwVHd3t2prawnc\ntyB0AQCWYj/33QhdAIClOjs72c99B/Z0AQCWCQaDKi8v13fffafNmzc7XU7GodMFAFimp6dHx48f\nJ3DfgdAFAFiG/dz1EboAAMsQuutjTxcAYImlpSVt375djx8/VmlpqdPlZCQ6XQCAJa5du6ajR48S\nuOsgdAEAlmBpeWOELgDAEoTuxtjTBQCkbHl5Wdu3b9f4+LjKysqcLidj0ekCAFLW19enQ4cOEbgb\nIHQBACljaTk+hC4AIGWEbnzY0wUApCQUCmnbtm0aGxvTjh07nC4no9HpAgBScuPGDVVXVxO4cSB0\nAQAp6ejoYGk5ToQuACAl7OfGjz1dAEDSwuGwtm/frnv37qmiosLpcjIenS4AIGm3bt3S7t27Cdw4\nEboAgKR1dHSora3N6TKyBqELAEga+7mJYU8XAJCUcDisHTt2aGRkRLt27XK6nKxApwsASMrg4KAq\nKioI3AQQugCApLC0nDhCFwCQFIaoEseeLgAgYZFIRBUVFerv79eePXucLidr0OkCABI2NDSkrVu3\nErgJInQBAAljPzc5hC4AIGGdnZ3s5yaBPV0AQEIMw9DOnTvV19enqqoqp8vJKnS6AICEjIyMyO/3\nE7hJIHQBAAlhPzd5hC4AICGEbvLY0wUAxM0wDFVWVqq7u1v79+93upysQ6cLAIjbvXv3VFhYqOrq\naqdLyUqELgAgbqtLyx6Px+lSshKhCwCIG/u5qSF0AQBxMQyD0E2R1+kCAACZ7y9/+YsWFxcVCoV0\n6NAhp8vJWkwvAwDWFYlEVF5erunpaUnSkSNH9K9//Ut79+51uLLsw/IyAGBdQ0NDscCVpKdPn6qy\nstLBirIXoQsAWFdnZ6fp848++kj5+fkOVZPdCF0AwLreDF0GqZJH6AIA3ml1Yvl1hG7yGKQCALzT\n8PCwjh8/Hvt88+bNmp6eltfLyy/JoNMFALzTm11uIBAgcFNA6AIA3unN0G1ra3OmkBxB6AIA3or9\nXOuxpwsAeKu7d+/q6NGjsc/9fr9mZmZUUFDgYFXZjU4XAPBWb3a5ra2tBG6KCF0AwFuxtGw9QhcA\nsMbb9nMZokode7oAgDVGR0dNtwkVFRVpdnZWhYWFDlaV/eh0AQBrdHR0mD5vaWkhcC1A6AIA1mA/\nNz0IXQDAGuznpgd7ugAAk4cPH2r//v2xzzdt2qTZ2Vn5fD4Hq8oNdLoAAJM3u9zm5mYC1yKELgDA\n5M0hKvZzrUPoAgBMGKJKH/Z0AQAxjx49UlVVVezzwsJCzczMqLi42MGqcgedLgAg5s0ut7GxkcC1\nEKELAIhhaTm9CF0AQAxDVOnFni4AQJL05MkT7dmzJ/a51+vV7Oys/H6/g1XlFjpdAICktUvLDQ0N\nBK7FCF0AgCT2c+3gdboAAICDJiak9nZpYED/8+WXCkgakNQuQjcd2NMFADfq7ZUuXJAuXYp+vrgY\n+60FSR5J3p/9TAV//KPU0OBIibmI0AUAt/niC+n8eSkYlNaLAI9HKiqSLl6Uzp2zr74cxvIyALjJ\nauAuLGz8tYYR/brz56OfE7wpo9MFALfo7ZXa2uIL3DcVF0udnVJ9veVluQnTywDgFhcuRJeUkxEM\nRr8fKaHTBQA3mJiQ9u0zDUwlzOeTxsel8nLr6nIZOl0AcIP29tSf4fFY8xwXY5AKAHKYYRgaGxuT\n5+9/14FUulwpusQ8OGhNYS5F6AJADllaWtKNGzfU1dWlK1eu6MqVK3r27Jn+IemAFT9gZsaKp7gW\noQsAWWxiYiIWrl1dXerr69Py8vKar5u16geWlVn1JFcidAEgS0QiEQ0PD5u62AcPHsT1vQOKnjSV\n0nX0RUXSyZOpPMH1CF0AyFBzc3Pq6emJdbFXr17VixcvEn6O3+/XWF2dCrq7pXA4+YIMQzp7Nvnv\nB6ELAJnAMAyNj4/HAvbKlSvq7+9XJBJJ+FlVVVUKBAJqbW1Va2urampq5PV6pU8/lb78cv2jH9/F\n45HOnOF1oRTxni4AOGBlZUU3b9407cc+efIk4ed4vV7V1dWptbVVgUBALS0t2rt379u/mBOpHEfo\nAoANpqam1N3dHQvY3t5eBZM4HaqsrCwWsK2trWpoaFBxcQI7tYmcvbyquJhLDyzC8jIAWMwwDN29\ne9c08HTnzp2knnXkyJFYwAYCAR0+fFh5eSmca7QanNwy5Ag6XQBI0cLCgnp7e2NdbHd3t6anpxN+\njs/nU2NjYyxgm5ubtWPHjjRULKmvL3qW8ldfRcP19a67qCgaxmfOSJ9/zpKyhQhdAEjQ48ePTQNP\nN2/eVCgUSvg5lZWVCgQCsU72gw8+UGFhYRoqXsfkZPRox8HB6MEXZWXR14LOnmVoKg0IXQBYRygU\n0sDAgGngaXx8POHn5OXlqba2NjZRHAgEVFVVJY/Hk4aqkanY0wWA18zOzurq1auxLranp0fz8/MJ\nP2fLli1qaWmJBWxjY6M2b96choqRTQhdAK5lGIZGR0djAdvV1aXh4WElswB48OBB01TxsWPHlJ+f\nn4aqkc0IXQCusbi4qOvXr5v2YycnJxN+TmFhoerr62NLxa2trdq5c2caKkauIXQB5KynT5/G9mKv\nXLmi69evv/UygI1UVFSYuthTp07J5/OloWLkOkIXQE4Ih8MaGhoydbFjY2MJP8fj8ej48eOmYxQP\nHjzIwBMsQegCyAn//Oc/9fOf/zzh7/P7/Wpubo51sk1NTdq6dWsaKgQIXQBZLhwO6/bt2xoZGYnr\n6/ft22daKj558mT0MgDABvxNA5BVXr58qatXr8b2aXt6elRZWRkbZnr27Fnsa1cvA3h9qXjPnj0O\nVg+343AMABnLMAx9/fXXpn3a0dFRnTp1KhakLS0tsaMSf/e73+n+/fuxTra+vj6xywCANCN0AWSM\npaUl3bx503RRgMfjMR3478hRiYBFCF0AjpmcnDQdr3jz5k0dPnzYtOe6b98+JoeRMwhdALaIRCIa\nGRkxLRVPTEzEJodbW1vV1NTEUYnIaYQugLSYm5vTtWvXYp1sd3e3tm/fzlGJcDVCF4AlxsfHTV3s\nnTt3VFtbaxp42rVrl9NlAo4idAEkbGVlRf39/aaBp6WlJdPAE0clAmsRugA2ND09re7u7ljA9vX1\nqbq62rRUzFGJwMYIXQAmhmHo3r17pqXib7/9Vo2NjbGBp+bmZo5KBJJA6AIuFwwG1dvba7qNp6Sk\nJBawgUCAoxIBixC6gMs8efLE9G7s7du319yqw1GJQHoQukAOC4VCun37tmng6eXLl6YulqMSAfsQ\nukAOefHiRewygK6uLl27dk179uwxDTwdOXKEgSfAIYQukKUMw9DY2NiaS9s//PBD07ux27dvd7pU\nAP9F6AJZYmlpSTdu3DAtFefn55veja2treUyACCDEbpAhpqYmDANPN26dUtHjhwxDTxVVVWxVAxk\nEUIXyACRSETDw8OmLnZyclItLS2xLraxsVElJSVOlwogBYQu4IC5uTn19PTEutirV6+qvLx8zWUA\neXl5TpcKwEKELpBmhmGsuQzg7t27+uCDD0xLxRUVFU6XCiDNCF3AYisrK7p165ZpqXhlZWXNZQCb\nNm1yulQANiN0gRRNTU3FLgPo6urS9evXdeDAAdNS8YEDBxh4AkDoAokwDEN37941LRU/fvxYTU1N\npssASktLnS4VQAYidIF1LCwsrLkMYMuWLaYu9sSJE1wGACAuhC7wmsePH5u62KGhIZ04ccI08LR7\n926nywSQpQhduFYoFNLg4GAsYLu6ujQ/P7/mMoCioiKnSwWQIwhduMbs7KzpMoDe3l7t3bvXtFR8\n+PBhBp4ApA2hi5xkGIZGR0dNS8UPHz5UfX19rJNtaWnRtm3bnC4VgIsQusgJi4uLun79umngqaCg\nQIFAINbF1tbWqqCgwOlSAbgYoYus9OzZM1MX29/fr6NHj665DAAAMgmhi4wXDofXXAYwNTVlugyg\noaGBywAAZDxCFxnn1atXpssAenp6VFFRYepi33//fS4DAJB1CF04yjAMffPNN6al4vv376uuri4W\nsK2trSovL3e6VABIGaELWy0vL6+5DCAcDpsuA6irq+MyAAA5idBFWj1//tx0GcCNGzd08OBB01Lx\n/v37eTcWgCsQurBMJBLR3bt3TV3sd999F7sMIBAIqKmpSVu2bHG6VABwBKGLpC0sLOjatWuxLra7\nu1tbt25dcxlAfn6+06UCQEYgdBG3b7/91jTwNDw8rJqaGtPAU2VlpdNlAkDGInTxVqFQSAMDA6al\n4oWFBVMX++GHH3IZAAAkgNCFJGlmZmbNZQBVVVWmgacf/OAHDDwBQAoIXRcyDEMPHjwwdbHffPON\nGhoaTJcBlJWVOV0qAOQUQtcFFhcX1dfXZ7oMwOfzmZaKa2pquAwAANKM0M1BT58+NQ08DQwM6Nix\nY6aBp/fee8/pMgHAdQjdLBcOhzU0NBQL2K6uLs3Ozq65DMDv9ztdKgC4HqGbZV6+fLnmMoBdu3aZ\nBp6OHj3KZQAAkIEI3QxmGIYePnxoWip+8OCBTp06FetiW1patGPHDqdLBQDEgdCVpIkJqb1dGhiQ\nXryQSkulmhrps88kG2+3WV5e1o0bN2LDTl1dXZKkQCAQ62Tr6upUWFhoW00AAOu4O3R7e6ULF6RL\nl6KfLy5+/3tFRZJhSKdPS59/LjU0WP7jJycn1d3dHetib968qUOHDpmWiqurq3k3FgByhHtD94sv\npPPnpWAwGq7v4vFEA/jiRencuaR/XCQS0Z07d0zvxj59+lTNzc2xpeLGxkYuAwCAHObO0F0N3IWF\n+L+nuDih4J2fn19zGcC2bdtMXezx48e5DAAAXMR9odvbK7W1JRa4q4qLpc5Oqb5+zW89evTINPA0\nMjKi2tpa07uxu3btSr1+AEDWcl/ofvqp9OWX6y8pv4vHI33yiVb++lf19/ebBp6WlpbWXAbg8/ms\nrx8AkLXcFboTE9K+feaBqQQt5eXpaFGR/NXVsYANBAI6ePAgA08AgHV5nS7AVu3tKT8i3+vV0B/+\noOI//Sn1egAAruKu0B0YSKnLlSTv8rK8Dx5YVBAAwE3cdVbgixfWPGdmxprnAABcxV2hW1pqzXO4\nZxYAkAR3hW5NjZTqRHFRkXTypDX1AABchenlRPl80vi4rWcyAwByg7s63YqK6FnKyb7a4/FIZ84Q\nuACApLir05XSdiIVAAAbcVenK0VvC7p4MRqgiVg9e5nABQAkyV3v6a5avbTAxluGAABw3/Ly6/r6\novfpfvVVNFyDwe9/b/U+3TNnovfp0uECAFLk7tBdNTkZPSJycDB68EVZWfS1oLNnGZoCAFiG0AUA\nwCbuG6QCAMAhhC4AADYhdAEAsAmhCwCATQhdAABsQugCAGATQhcAAJsQugAA2ITQBQDAJoQuAAA2\nIXQBALAJoQsAgE0IXQAAbELoAgBgE0IXAACbELoAANiE0AUAwCaELgAANiF0AQCwCaELAIBNCF0A\nAGxC6AIAYBNCFwAAmxC6AADYhNAFAMAmhC4AADYhdAEAsAmhCwCATQhdAABsQugCAGATQhcAAJsQ\nugAA2ITQBQDAJoQuAAA2IXQBALAJoQsAgE0IXQAAbELoAgBgk/8HfC5KKCI1neoAAAAASUVORK5C\nYII=\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x7f48fa388358>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import networkx as nx\n",
    "%matplotlib inline\n",
    "\n",
    "results = %cypher MATCH p = (:Person)-[:LIKES]->(:Drink) RETURN p\n",
    "\n",
    "g = results.get_graph()\n",
    "\n",
    "nx.draw(g)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('5337', {'age': 20, 'labels': ['Person'], 'name': 'Drew'}),\n",
       " ('5339', {'calories': 9000, 'labels': ['Drink'], 'name': 'Mountain Dew'}),\n",
       " ('5338', {'age': 24, 'labels': ['Person'], 'name': 'Nicole'}),\n",
       " ('5340', {'calories': 0, 'labels': ['Drink'], 'name': 'Coke Zero'})]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.nodes(data=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'5337': 1, '5338': 2, '5339': 2, '5340': 1}"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nx.degree(g)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "# jgraph\n",
    "\n",
    "`jgraph` will plot tuple lists as 3D graphs."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"graph-33bb637a-fe12-4d31-98c1-098e6ebfcddb\"></div>\n",
       "           <script type=\"text/javascript\">\n",
       "           require.config({baseUrl: '/',\n",
       "                             paths: {jgraph: ['nbextensions/jgraph.min', 'https://rawgit.com/patrickfuller/jgraph/master/js/build/jgraph.min']}});\n",
       "           require(['jgraph'], function () {\n",
       "               var $d = $('#graph-33bb637a-fe12-4d31-98c1-098e6ebfcddb');\n",
       "               $d.width(600); $d.height(400);\n",
       "               $d.jgraph = jQuery.extend({}, jgraph);\n",
       "               $d.jgraph.create($d, {nodeSize: 2.000000,\n",
       "                                     edgeSize: 0.250000,\n",
       "                                     defaultNodeColor: '0x5bc0de',\n",
       "                                     defaultEdgeColor: '0xaaaaaa',\n",
       "                                     shader: 'basic',\n",
       "                                     z: 100,\n",
       "                                     runOptimization: true,\n",
       "                                     directed: true,\n",
       "                                     showSave: false});\n",
       "               $d.jgraph.draw({\n",
       "    \"edges\": [\n",
       "        { \"source\": 1, \"target\": 2 },\n",
       "        { \"source\": 2, \"target\": 3 },\n",
       "        { \"source\": 3, \"target\": 4 },\n",
       "        { \"source\": 4, \"target\": 1 },\n",
       "        { \"source\": 4, \"target\": 5 },\n",
       "        { \"source\": 5, \"target\": 2 }\n",
       "    ],\n",
       "    \"nodes\": {\n",
       "        \"1\": { \"location\": [ -2.0, -2.0, -2.0 ] },\n",
       "        \"2\": { \"location\": [ -0.9461516086599593, -0.7194854432857765, -1.3992006385676505 ] },\n",
       "        \"3\": { \"location\": [ -0.18125179724996496, -0.18198768289523493, 0.3189414737029518 ] },\n",
       "        \"4\": { \"location\": [ 1.1329805146193213, 1.1756159218463949, 1.4723647359884806 ] },\n",
       "        \"5\": { \"location\": [ 2.0, 2.0, 1.9975328459996018 ] }\n",
       "    }\n",
       "});\n",
       "\n",
       "               $d.resizable({\n",
       "                   aspectRatio: 600 / 400,\n",
       "                   resize: function (evt, ui) {\n",
       "                       $d.jgraph.renderer.setSize(ui.size.width,\n",
       "                                                  ui.size.height);\n",
       "                   }\n",
       "               });\n",
       "           });\n",
       "           </script>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import jgraph\n",
    "\n",
    "jgraph.draw([(1, 2), (2, 3), (3, 4), (4, 1), (4, 5), (5, 2)])"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python [conda env:serenata_de_amor]",
   "language": "python",
   "name": "conda-env-serenata_de_amor-py"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.5.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
