{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# Hello World\n",
    "\n",
    "This notebook walks through basic code examples for integrating various packages with Neo4j, including `py2neo`, `ipython-cypher`, `pandas`, `networkx`, `igraph`, and `jgraph`."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# py2neo\n",
    "\n",
    "`py2neo` is one of Neo4j's Python drivers. It offers a fully-featured interface for interacting with your data in Neo4j. Install `py2neo` with `pip install py2neo`."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Connect\n",
    "\n",
    "Connect to Neo4j with the `Graph` class."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "\n",
    "graph = Graph()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {
    "collapsed": true,
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "skip"
    }
   },
   "outputs": [],
   "source": [
    "graph.delete_all()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Nodes\n",
    "\n",
    "Create nodes with the `Node` class. The first argument is the node's label. The remaining arguments are an arbitrary amount of node properties or key-value pairs."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [],
   "source": [
    "from py2neo import Node\n",
    "\n",
    "nicole = Node(\"Person\", name=\"Nicole\", age=24)\n",
    "drew = Node(\"Person\", name=\"Drew\", age=20)\n",
    "\n",
    "mtdew = Node(\"Drink\", name=\"Mountain Dew\", calories=9000)\n",
    "cokezero = Node(\"Drink\", name=\"Coke Zero\", calories=0)\n",
    "\n",
    "coke = Node(\"Manufacturer\", name=\"Coca Cola\")\n",
    "pepsi = Node(\"Manufacturer\", name=\"Pepsi\")\n",
    "\n",
    "graph.create(nicole | drew | mtdew | cokezero | coke | pepsi)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"figure/graph-Example 1.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7fc1bc5b7748>"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from scripts.vis import draw\n",
    "\n",
    "options = {\"Person\": \"name\", \"Drink\": \"name\", \"Manufacturer\": \"name\"}\n",
    "draw(graph, options, graph_name=\"Example 1\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "skip"
    }
   },
   "source": [
    "P.S. - If you want to check out what's going on behind the scenes for the `draw()` function used above, take a look at [`scripts/vis.py`](https://github.com/nicolewhite/neo4j-jupyter/blob/master/scripts/vis.py)."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Relationships\n",
    "\n",
    "Create relationships between nodes with the `Relationship` class."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"figure/graph-Example 2.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7fc1bc5a0588>"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Relationship\n",
    "\n",
    "graph.create(Relationship(nicole, \"LIKES\", cokezero))\n",
    "graph.create(Relationship(nicole, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(drew, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(coke, \"MAKES\", cokezero))\n",
    "graph.create(Relationship(pepsi, \"MAKES\", mtdew))\n",
    "\n",
    "draw(graph, options, graph_name=\"Example 2\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Cypher\n",
    "\n",
    "Retrieve Cypher query results with `Graph.cypher.execute`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "('name': 'Nicole', 'drink': 'Mountain Dew')\n",
      "('name': 'Nicole', 'drink': 'Coke Zero')\n",
      "('name': 'Drew', 'drink': 'Mountain Dew')\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name AS name, drink.name AS drink\n",
    "\"\"\"\n",
    "\n",
    "data = graph.run(query)\n",
    "\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Parameterized Cypher\n",
    "\n",
    "Pass parameters to Cypher queries by passing additional key-value arguments to `Graph.cypher.execute.` Parameters in Cypher are named and are wrapped in curly braces."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "('name': 'Nicole', 'avg_calories': 4500.0)\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (p:Person)-[:LIKES]->(drink:Drink)\n",
    "WHERE p.name = {name}\n",
    "RETURN p.name AS name, AVG(drink.calories) AS avg_calories\n",
    "\"\"\"\n",
    "\n",
    "data = graph.run(query, name=\"Nicole\")\n",
    "\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# ipython-cypher\n",
    "\n",
    "`ipython-cypher` exposes `%cypher` magic in Jupyter. Install `ipython-cypher` with `pip install ipython-cypher`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The cypher extension is already loaded. To reload it, use:\n",
      "  %reload_ext cypher\n"
     ]
    }
   ],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Cypher\n",
    "\n",
    "`%cypher` is intended for one-line Cypher queries and `%%cypher` is intended for multi-line Cypher queries. Placing `%%cypher` above a Cypher query will display that query's results."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>person.name</th>\n",
       "        <th>drink.name</th>\n",
       "        <th>drink.calories</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Coke Zero</td>\n",
       "        <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Drew</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Nicole', 'Mountain Dew', 9000],\n",
       " ['Nicole', 'Coke Zero', 0],\n",
       " ['Drew', 'Mountain Dew', 9000]]"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name, drink.name, drink.calories"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Pandas Data Frames\n",
    "\n",
    "Cypher query results can be coerced to `pandas` data frames with the `get_dataframe` method. To assign Cypher query results to a variable, you need to use `%cypher` and separate lines with \\\\. You'll first need to install `pandas` with `pip install pandas`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>drink</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Coke Zero</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Drew</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     name         drink\n",
       "0  Nicole  Mountain Dew\n",
       "1  Nicole     Coke Zero\n",
       "2    Drew  Mountain Dew"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = %cypher MATCH (person:Person)-[:LIKES]->(drink:Drink) \\\n",
    "                  RETURN person.name AS name, drink.name AS drink\n",
    "    \n",
    "df = results.get_dataframe()\n",
    "\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "RangeIndex(start=0, stop=3, step=1)"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.index"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>drink</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Coke Zero</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     name      drink\n",
       "1  Nicole  Coke Zero"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.iloc[[1]]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0    Nicole\n",
       "1    Nicole\n",
       "2      Drew\n",
       "Name: name, dtype: object"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df[\"name\"]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## NetworkX Graphs\n",
    "\n",
    "Cypher query results can be coerced to `NetworkX` MultiDiGraphs, graphs that permit multiple edges between nodes, with the `get_graph` method. You'll first need to install `NetworkX` with `pip install networkx`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true,
    "scrolled": true,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAeIAAAFBCAYAAACrYazjAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAGBZJREFUeJzt3V9slHW+x/HP05bSGTpAkTYsIizCVl1oFekUEUr/YQjI\nbg7mbLInMYo3ZrliTw67pNkLw4k5DdqzG65IvDipnOy52MSoWVePObSlLSB2WgWKKLUgLf/b0NKd\n2mnpn+dcII/ULdI/M/N7Zp73K+kFZmb6HdG++51n5nks27ZtAQAAI1JMDwAAgJcRYgAADCLEAAAY\nRIgBADCIEAMAYBAhBgDAIEIMAIBBhBgAAIMIMQAABhFiAAAMIsQAABhEiAEAMIgQAwBgECEGAMAg\nQgwAgEGEGAAAgwgxAAAGEWIAAAwixAAAGESIAQAwiBADAGAQIQYAwCBCDACAQYQYAACDCDEAAAYR\nYgAADCLEAAAYRIgBADCIEAMAYBAhBgDAIEIMAIBBhBgAAIMIMQAABhFiAAAMIsQAABhEiAEAMIgQ\nAwBgECEGAMAgQgwAgEGEGAAAgwgxAAAGEWIAAAwixAAAGJRmegCv6urq0qHqarWdPq3+vj5lzpun\n3Px8vfzKK8rOzjY9HgAgTizbtm3TQ3hJKBTSgcpK/e2jj/SCpODgoAKSwpKafD69a9t6futW7a6o\nUDAYNDwtAJjjlYWFEMfRWwcP6rU9e7Q3EtHLtq2sCW7TK6nasvSGz6d9VVV6ddeueI8JAEZ5bWEh\nxHHy1sGD2r9njz4eGNDKSdy+XdIWv197iTEAD/HiwkKI4yAUCumXJSVqnGSE72qXVOT366/19Soo\nKIjVeADgCl5dWAhxHLz4wgsqeO89/XYa/6r/ZFn6bMcO/fc778RgMgBwBy8vLIQ4xrq6uvTYsmW6\nMDg44UssD9IjacXs2Wptb1dOTo4sy5rwCwASmZcXFkIcY1VvvKGzr72m/xocnPZj/FrSXyQ96C/q\nfpGO9lc8v9dUvgoKClRVVTXtf88AzIjKwpKRobbOzoR8NzWfI46xttOnVTiDCEtSsaT3JT3oUWzb\nlpd/r+rv71dDQ0NS/XIxnecBJJpD1dXaIU0rwpK0QNIOy9Kh6mr92+9+F8XJ4oMQx1h/X58CM3yM\ngPiLmozz58/rD3/4g/MLyVS+JE3rfm75uley/XKRjL8w8ZzGf/3fBx9oxwwXlmAkopOtrTN6DFP4\n+R5jmfPmKTzDxwhLGrMspaWm/ugPYK8rLCzUxx9/bHoMY5Ltl4tkfz6xfk5jY2MJ85y++frrqCws\n4d7eGT6KGYQ4xnLz89X0zjv6zQx+2wv5fPr3ffvu+5JLIvyPFo+vrKzpvrCVHO7dRoBE8uqLLyr8\n5z/P6DHCkgIJ+jOAEMfYSzt36rHXXtN/anrHP3okvWvb2r9z531vww9gAIksWgvLqry8KE4VP1x9\nKcZycnL0/NatenuaoXzbsrR927aEfCcgAEzGSzt36l3dOWPWdNxdWF76kYXFzQhxHOyuqNB+n0/t\nU7xfu6Q3fD7trqiIxVgA4ApeX1gIcRwEg0Htq6rSFr9/0jG+e+q2fVVVCXu2GACYLC8vLIQ4Tl7d\ntUt7q6pU5PfrT5Z135dgeiT90bJUlATnTwWAyfLywsKZteKsublZByor9cGHH2qHZSkYiTiX9wp9\nd3mv7du2aXdFRUL/hwUA03H36ku/j0S005746ks9unP1pTe5+hJmoru7+84Fr1tbFe7tVSArS7l5\neXpp586EPc4BANFw78LyT5IK77kecTIuLIQYAOBK3d3d+o/XX9dfDh1S8caNSbuw8DliAIArZWdn\nq6i4WBcuXtT/vP++6XFihjdrAQBcq7OzU0uXLjU9RkwRYgCAa3V0dGjZsmWmx4gpQgwAcC02YgAA\nDGIjBgDAoI6OjqTfiPn4EgDAlQYGBrRgwQINDAwoJSV598bkfWYAgITW2dmpRx55JKkjLBFiAIBL\neeGNWhIhBgC4lBfeqCURYgCAS7ERAwBgEBsxAAAGsREDAGCQVzZiPkcMAHCd0dFR+f1+9fX1KSMj\nw/Q4McVGDABwnWvXrmnBggVJH2GJEAMAXMgrx4clQgwAcCGvHB+WCDEAwIUIMQAABvHSNAAABrER\nAwBgEBsxAACG2LbNRgwAgCl9fX2ybVvz5883PUpcEGIAgKvc3YYtyzI9SlwQYgCAq3jp+LBEiAEA\nLuOl48MSIQYAuAwbMQAABrERAwBgUGdnJyEGAMCUjo4OT700bdm2bZseAgAASRoaGlIgEFAkElFq\naqrpceKCjRgA4BqXL1/W4sWLPRNhiRADAFzEa2/UkggxAMBFvPbRJYkQAwBchI0YAACD2IgBADCI\njRgAAIO8uBHzOWIAgCuMjY3J7/fr5s2bmjNnjulx4oaNGADgCt3d3crMzPRUhCVCDABwCS8eH5YI\nMQDAJbx2sYe7CDEAwBW8drGHuwgxAMAV2IgBADCIjRgAAIN4sxYAAAZ58WQeEiEGALhAf3+/BgYG\nlJ2dbXqUuCPEAADj7m7DlmWZHiXuCDEAwDivHh+WCDEAwAW8enxYIsQAABdgIwYAwCCvnsxDIsQA\nABfw6sk8JEIMAHABL2/Elm3btukhAADeNTIyIr/fr/7+fqWnp5seJ+7YiAEARl29elU5OTmejLBE\niAEAhnn5+LBEiAEAhnn5o0sSIQYAGOblk3lIhBgAYBgbMQAABrERAwBgkNc3Yj5HDAAwxrZtBQIB\nXb16VXPnzjU9jhFsxAAAY3p6epSWlubZCEuEGABgkJdPbXkXIQYAGOP1k3lIhBgAYBAbMSEGABjE\nRkyIAQAGsRETYgCAQWzEhBgAYJDXT+YhcUIPAIAhkUhE8+fPVyQSUUqKd/dC7z5zAIBRly5d0pIl\nSzwdYYkQAwAM4Y1adxBiAIARvFHrDkIMADCCjfgOQgwAMIKN+A5CDAAwgo34DkIMADCCjfgOPkcM\nAIi7sbEx+Xw+3bp1Sz6fz/Q4RrERAwDi7vr165o/f77nIywRYgCAARwf/h4hBgDEHceHv0eIAQBx\nx0b8PUIMAIib0dFR3b59m6su3SPN9AAAAO9oaWnRM888o/T0dP30pz/VlStXtH//ftNjGcVGDACI\nm87OTtm2raGhIZ07d05ffPGF6ZGMI8QAgLjp6OgY92denibEAIA46uzsHPdn3jlNiAEAccRG/I8I\nMQAgbtiI/xEhBgDEDRvxP+KiDwCAuOjv71cgEHD+PGvWLA0ODiolxds7obefPQAgbn74svSSJUs8\nH2GJEAMA4oSXpSdGiAEAccEbtSZGiAEAccFGPDFCDACICzbiiRFiAEBcsBFPjBADAOKCjXhifI4Y\nABBzIyMjysjI0OjoqPPPBgYG5PP5DE7lDmzEAICYu3r16rgIZ2dnE+HvEGIAQMxxfPj+CDEAIOZ+\neHyYEH+PEAMAYu6HGzFv1PoeIQYAxBwvTd8fIQYAxBwfXbo/QgwAiDk24vtLMz0AACB5dXV16e3q\nal1ua1OmpFFJg5L8fr/hydyDE3oAAKIuFArpQGWl/vbRR9ohqXBwUAFJYUn1kv43I0PPb92q3RUV\nCgaDZoc1jBADAKLqrYMH9dqePdobiehl21bWBLfplVRtWXrD59O+qiq9umtXvMd0DUIMAIiatw4e\n1P49e/TxwIBWTuL27ZK2+P3a6+EYE2IAQFSEQiH9sqREjZOM8F3tkor8fv21vl4FBQWxGs+1eNc0\nACAqDlRWam8kMqUIS9JKSb+PRHSgsjIWY7keGzEAYMa6urr02LJlujA4OOEx4QfpkbQiI0NtnZ3K\nzs6O9niuxkYMAJixQ9XV2iFNK8KStEDSDsvSoerq6A2VIAgxAGDG2k6fVuHg4IweIxiJqK21NUoT\nJQ5CDACYkRs3bujc2bMKzPBxApLCvb3RGCmhcGYtAMCU9Pf3q6GhQYcPH9bhw4fV2toqn6R/meHj\nhiUFsqb74nbiIsQAgB81PDysUCjkhPeTTz7RyMjIuNsM6s4Zs34zg+8T8vm0Ki9vJqMmJN41DQAY\nx7Ztffnll054jxw5onA4/MD7ZUi6qum9YcvL75pmIwYA6PLly6qpqdHhw4dVU1Oja9euTfq+KSkp\nKigo0PCtW6r++mv96zT2u7ctS9u3bfNchCU2YgDwpL6+Ph05csTZer/66qsp3T83N1ebN2/W5s2b\nVVJSoqysLM6sNU2EGAA8YGhoSCdOnHDC29TUpLGxsUnfPycnxwlveXm5li5dOuHtONf01PHSNAAk\nobGxMbW2tjrhbWho0MDAwKTvP2fOHBUXFzvxXb16tSzLeuD97sa0aM8e/T4S0c77XH2pR3euvvQm\nV19iIwaAZNHR0eGEt6amRt3d3ZO+b2pqqtatW+eEd926dUpPT5/2LM3NzTpQWakPPvxQOyxLwUjE\nuR5xyOfTu7at7du2aXdFhSdfjr4XIQaABNXT06O6ujonvu3t7VO6/6pVq1ReXq7NmzeruLhYc+fO\njfqM3d3dOlRdrbbWVoV7exXIylJuXp5e2rnTk2/MmgghBoAEMTg4qGPHjjnhbWlp0VR+hC9evFjP\nPfecNm/erLKyMi1evDiG02KyOEYMAC41OjqqkydPOuE9evSoBqdwPue5c+eqtLTUebn5sccem9Rx\nXsQXIQYAl7BtW+fPn3fCW1tbq94pnHt51qxZevbZZ53wFhQUKC2NH/Nux98QABjU1dWl2tpaJ74d\nHR1Tuv+TTz7phLeoqEhz5syJ0aSIFUIMAHH07bffqrGx0QnvqVOnpnT/pUuXjjvOm5OTE6NJES+E\nGABiaGRkRM3NzU54jx8/ruHh4UnfPysrS2VlZc7Wu2LFCo7zJhlCDABRZNu2zp0754S3rq5Of//7\n3yd9/9mzZ2vjxo1OeNesWaPU1NQYTgzTCDEARMkXX3yhLVu26MqVK5O+j2VZevrpp53wbtiwQT6f\nL4ZTwm0IMQBESSAQ0I0bNx54uxUrVjjhLS0t1UMPPRSH6eBWnNADAKZpYGBAR48edV6GPn/+vGbN\nmqWbN2+Ou93ChQudM1iVl5dr+fLlhiaGGxFiAJik0dFRtbS0OOENhUJas2aNs90Gg0G9+eabev31\n17Vp0ybnn+fn5yslJcX0+HApQgwA92Hbttra2pzw1tfXa8mSJU5gN23apMzMzHH3CYfDSk9P1+zZ\nsw1NjURDiAHgHtevX1dNTY0TX8uynPCWlZVp0aJFpkdEkiHEADwtHA6roaHBCe/ly5fHnZ/5Zz/7\nGZ/bRUwRYgCeMjw8rKamJie8n3/+uQoLC53wrl27ls/tIq4IMYCkZtu2zp4964S3oaFh3MeHNm7c\nKL/fb3pMeBghBpB0Ll++PO44r8/nG3ecd+HChaZHBByEGEDC6+vr05EjR5zwdnd3j/vc7qOPPmp6\nROC+CDGAhDM0NKQTJ0444T1z5sy46/A++eSTfG4XCYMQA3C9sbExtba2OuE9duyYnnjiCSe869ev\nV0ZGhukxgWkhxABc6eLFi85x3pqaGmVlZTnhLSkpUVZWlukRgaggxABc4ebNm6qrq3O23nA47IS3\nvLxcS5cuNT0iEBOEGIARkUhEx44dc8Lb1tamoqIiJ76rV6/mRBrwBEIMIC5GR0f1+eefO+H99NNP\nlZ+f74R33bp1Sk9PNz0mEHeEGEBM2Lat8+fPO+Gtq6vTokWLnPAWFxdr7ty5pscEjCPEAKKmq6tL\ntbW1TnyHh4fHHeddvHix6REB1yHEAKbt22+/VWNjoxPeixcvqri42Inv448/znFe4AEIMYBJGxkZ\nUXNzsxPelpYWrV271tl4g8Gg0tLSTI8JJBRCDOC+bNvWuXPnnPDW19dr2bJlzsZbVFSkOXPmmB4T\nSGiEGMA4165dG3fBhNTUVD333HPOBRNycnJMjwgkFUIMeFw4HFZ9fb0T3qtXr6qsrMzZelesWMFx\nXiCGCDHgMbdv39ann37qnDry1KlTWrdunRPeNWvWKDU11fSYgGcQYiDJ2batM2fOOBtvY2OjcnNz\nnfBu2LBBPp/P9JiAZxFiIAldunTJCW9NTY0yMzOd8JaWluqhhx4yPSKA7xBiIAncunVr3AUTenp6\nVF5e7nysaPny5aZHBHAfhBhIQENDQzp+/LgT3rNnz2rDhg3O1pufn6+UlBTTYwKYBEIMJICxsTGd\nOnXKCe/x48e1atUqJ7zr16/X7NmzTY8JYBoIMeBS33zzjRPe2tpaLVy4cNwFE+bPn296RABRQIgB\nl7h58+a4CyYMDAyMu2DCkiVLTI8IIAYIMWBIJBLR0aNHnfC2t7dr06ZNTnx//vOfcyINwAMIMRAn\no6Oj+uyzz5zwNjU16amnnnLCW1hYqFmzZpkeE0CcEWIgRmzbVnt7uxPeuro6Pfzww054N23apEAg\nYHpMAIYRYiCKbty4Me447+jo6LgLJvzkJz8xPSIAlyHEwAz09/eroaHBCe+lS5dUUlLibL25ubkc\n5wXwowgxMAXDw8MKhUJOeD/77DMFg0EnvGvXrlVaWprpMQEkEEIM/AjbtvXll1864W1oaNDy5cud\n8G7cuFFz5swxPSaABEaIgR+4cuWKampqnPimp6ePO86bnZ1tekQASYQQw/P6+vpUX1/vhPfGjRsq\nKytztt5HH32U47wAYoYQw3Nu376tEydOOOFtbW3V+vXrnfA+9dRTXDABQNwQYiS9sbExnTlzxgnv\n0aNH9fjjjzvhffbZZ5WRkWF6TAAeRYiRlDo7O53w1tTUaN68eU54S0pKtGDBAtMjAoAkQowk0dvb\nq7q6Oie+t27dGnfBhGXLlpkeEQAmRIiRkAYHB3X8+HEnvF999ZU2btzoxHf16tUc5wWQEAgxEsLY\n2JhOnjzphPeTTz5RXl6eE95nnnlG6enppscEgCkjxHCtCxcuOOGtra1VTk6OE97i4mLNmzfP9IgA\nMGOEGK7R3d097oIJQ0ND447zPvzww6ZHBICoI8QwZmBgQI2NjU54L1y4oOLiYie+TzzxBCfSAJD0\nCLFHdXV16VB1tdpOn1Z/X58y581Tbn6+Xn7llZidwnFkZEQtLS1OeJubm7VmzRonvMFgULNmzYrJ\n9wYAtyLEHhMKhXSgslJ/++gjvSApODiogKSwpCafT+/atp7fulW7KyoUDAZn9L1s21ZbW5sT3iNH\njuiRRx5xwrtp0yZlZmZG42kBQMIixB7y1sGDem3PHu2NRPSybStrgtv0Sqq2LL3h82lfVZVe3bVr\nSt/j+vXr4y6YYFmWE96ysjItWrQoKs8FAJIFIfaItw4e1P49e/TxwIBWTuL27ZK2+P3a+4AYh8Nh\nNTQ0OOG9cuWKSktLnfiuXLmS47wA8CMIsQeEQiH9sqREjZOM8F3tkor8fv21vl4FBQWSpOHhYTU1\nNTnhPXnypAoLC53wPv3000pNTY3J8wCAZESIPeDFF15QwXvv6bfT+Kv+o2WpvrxcZdu36/Dhw2po\naNDKlSud8G7YsEF+vz8GUwOANxDiJNfV1aXHli3ThcHBCY8JP0iPpCWWpX9+8UX94he/UGlpqRYu\nXBjtMQHAs9JMD4DYOlRdrR3StCIsSQsk/TojQ6vy8vSrX/0qipMBACSJs+InubbTp1U4ODijxwhG\nImprbY3SRACAexHiJNff16fADB8jICnc2xuNcQAAP0CIk1zmvHkKz/AxwpICWdN9cRsA8GMIcZLL\nzc9XU0bGjB4j5PMpNy8vShMBAO7Fu6aTXDTeNb0iI0NtnZ0xOwc1AHgZG3GSy8nJ0fNbt+rtaZ7d\n6m3L0vZt24gwAMQIG7EHRPPMWgCA6GIj9oBgMKh9VVXa4verfZL3uXuu6X1VVUQYAGKIEHvEq7t2\naW9VlYr8fv3JsnS/DyP16M5pLYsmccEHAMDM8dK0xzQ3N+tAZaU++PBD7bAsBSMR53rEoe+uR7x9\n2zbtrqhgEwaAOCDEHtXd3a1D1dVqa21VuLdXgaws5ebl6aWdO3ljFgDEESEGAMAgjhEDAGAQIQYA\nwCBCDACAQYQYAACDCDEAAAYRYgAADCLEAAAYRIgBADCIEAMAYBAhBgDAIEIMAIBBhBgAAIMIMQAA\nBhFiAAAMIsQAABhEiAEAMIgQAwBgECEGAMAgQgwAgEGEGAAAgwgxAAAGEWIAAAwixAAAGESIAQAw\niBADAGAQIQYAwCBCDACAQYQYAACDCDEAAAYRYgAADCLEAAAYRIgBADCIEAMAYBAhBgDAIEIMAIBB\nhBgAAIMIMQAABhFiAAAMIsQAABhEiAEAMIgQAwBgECEGAMAgQgwAgEGEGAAAgwgxAAAGEWIAAAwi\nxAAAGESIAQAwiBADAGAQIQYAwCBCDACAQf8PSKVpvD/T140AAAAASUVORK5CYII=\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x7fc1bf0714a8>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import networkx as nx\n",
    "%matplotlib inline\n",
    "\n",
    "results = %cypher MATCH p = (:Person)-[:LIKES]->(:Drink) RETURN p\n",
    "\n",
    "g = results.get_graph()\n",
    "\n",
    "nx.draw(g)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('11795', {'calories': 0, 'labels': ['Drink'], 'name': 'Coke Zero'}),\n",
       " ('11799', {'age': 20, 'labels': ['Person'], 'name': 'Drew'}),\n",
       " ('11797', {'age': 24, 'labels': ['Person'], 'name': 'Nicole'}),\n",
       " ('11794', {'calories': 9000, 'labels': ['Drink'], 'name': 'Mountain Dew'})]"
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.nodes(data=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'11794': 2, '11795': 1, '11797': 2, '11799': 1}"
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nx.degree(g)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# igraph\n",
    "\n",
    "Cypher query results can be imported into `igraph` with `py2neo`. You'll need to install `igraph` with `pip install python-igraph`. Query results should be returned as edgelists, as `igraph` has a method for building an `igraph` object from a list of tuples representing edges between nodes."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "ename": "DeprecationWarning",
     "evalue": "To avoid name collision with the igraph project, this visualization library has been renamed to 'jgraph'. Please upgrade when convenient.",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mDeprecationWarning\u001b[0m                        Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-17-83f9b4c09ddb>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[1;32m      1\u001b[0m \u001b[0;32mfrom\u001b[0m \u001b[0mpy2neo\u001b[0m \u001b[0;32mimport\u001b[0m \u001b[0mGraph\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0mPGraph\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m----> 2\u001b[0;31m \u001b[0;32mfrom\u001b[0m \u001b[0migraph\u001b[0m \u001b[0;32mimport\u001b[0m \u001b[0mGraph\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0mIGraph\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m      3\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      4\u001b[0m \u001b[0mneo4j\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mPGraph\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      5\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m/home/marcus/anaconda/envs/serenata_de_amor/lib/python3.5/site-packages/igraph/__init__.py\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[1;32m      6\u001b[0m \u001b[0m__license__\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;34m\"MIT\"\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      7\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m----> 8\u001b[0;31m raise DeprecationWarning(\"To avoid name collision with the igraph project, \"\n\u001b[0m\u001b[1;32m      9\u001b[0m                          \u001b[0;34m\"this visualization library has been renamed to \"\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     10\u001b[0m                          \"'jgraph'. Please upgrade when convenient.\")\n",
      "\u001b[0;31mDeprecationWarning\u001b[0m: To avoid name collision with the igraph project, this visualization library has been renamed to 'jgraph'. Please upgrade when convenient."
     ]
    }
   ],
   "source": [
    "from py2neo import Graph as PGraph\n",
    "from igraph import Graph as IGraph\n",
    "\n",
    "neo4j = PGraph()\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name AS source, drink.name AS target\n",
    "\"\"\"\n",
    "\n",
    "data = neo4j.run(query)\n",
    "tups = []\n",
    "\n",
    "for d in data:\n",
    "    tups.append((d[\"source\"], d[\"target\"]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "ename": "NameError",
     "evalue": "name 'IGraph' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mNameError\u001b[0m                                 Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-18-fdde58cbe06b>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[0;32m----> 1\u001b[0;31m \u001b[0mig\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mIGraph\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mTupleList\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mtups\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m      2\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m      3\u001b[0m \u001b[0mig\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mNameError\u001b[0m: name 'IGraph' is not defined"
     ]
    }
   ],
   "source": [
    "ig = IGraph.TupleList(tups)\n",
    "\n",
    "ig"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "ename": "NameError",
     "evalue": "name 'ig' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mNameError\u001b[0m                                 Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-19-a7b11f3daf07>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m()\u001b[0m\n\u001b[0;32m----> 1\u001b[0;31m \u001b[0mbest\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mig\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mvs\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mselect\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0m_degree\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mig\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mmaxdegree\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0;34m\"name\"\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m      2\u001b[0m \u001b[0mbest\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mNameError\u001b[0m: name 'ig' is not defined"
     ]
    }
   ],
   "source": [
    "best = ig.vs.select(_degree = ig.maxdegree())[\"name\"]\n",
    "best"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true,
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# jgraph\n",
    "\n",
    "`jgraph` will plot tuple lists as 3D graphs."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"graph-689eda40-ed82-416d-b335-029722c322aa\"></div>\n",
       "           <script type=\"text/javascript\">\n",
       "           require.config({baseUrl: '/',\n",
       "                             paths: {jgraph: ['nbextensions/jgraph.min', 'https://rawgit.com/patrickfuller/jgraph/master/js/build/jgraph.min']}});\n",
       "           require(['jgraph'], function () {\n",
       "               var $d = $('#graph-689eda40-ed82-416d-b335-029722c322aa');\n",
       "               $d.width(600); $d.height(400);\n",
       "               $d.jgraph = jQuery.extend({}, jgraph);\n",
       "               $d.jgraph.create($d, {nodeSize: 2.000000,\n",
       "                                     edgeSize: 0.250000,\n",
       "                                     defaultNodeColor: '0x5bc0de',\n",
       "                                     defaultEdgeColor: '0xaaaaaa',\n",
       "                                     shader: 'basic',\n",
       "                                     z: 100,\n",
       "                                     runOptimization: true,\n",
       "                                     directed: true,\n",
       "                                     showSave: false});\n",
       "               $d.jgraph.draw({\n",
       "    \"edges\": [\n",
       "        { \"source\": 1, \"target\": 2 },\n",
       "        { \"source\": 2, \"target\": 3 },\n",
       "        { \"source\": 3, \"target\": 4 },\n",
       "        { \"source\": 4, \"target\": 1 },\n",
       "        { \"source\": 4, \"target\": 5 },\n",
       "        { \"source\": 5, \"target\": 2 }\n",
       "    ],\n",
       "    \"nodes\": {\n",
       "        \"1\": { \"location\": [ -2.0, -2.0, -2.0 ] },\n",
       "        \"2\": { \"location\": [ -1.0746527889923414, -1.0504290902019673, -0.9687830889933474 ] },\n",
       "        \"3\": { \"location\": [ -0.35433863833478013, 0.13726096285088632, 0.21712858072573904 ] },\n",
       "        \"4\": { \"location\": [ 1.2539699936801654, 0.9862834369900845, 1.1385645553275074 ] },\n",
       "        \"5\": { \"location\": [ 2.0, 2.0, 1.8032273884182002 ] }\n",
       "    }\n",
       "});\n",
       "\n",
       "               $d.resizable({\n",
       "                   aspectRatio: 600 / 400,\n",
       "                   resize: function (evt, ui) {\n",
       "                       $d.jgraph.renderer.setSize(ui.size.width,\n",
       "                                                  ui.size.height);\n",
       "                   }\n",
       "               });\n",
       "           });\n",
       "           </script>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import jgraph\n",
    "\n",
    "jgraph.draw([(1, 2), (2, 3), (3, 4), (4, 1), (4, 5), (5, 2)])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"graph-78bded5d-4805-4fb6-99b1-9b68c070d94d\"></div>\n",
       "           <script type=\"text/javascript\">\n",
       "           require.config({baseUrl: '/',\n",
       "                             paths: {jgraph: ['nbextensions/jgraph.min', 'https://rawgit.com/patrickfuller/jgraph/master/js/build/jgraph.min']}});\n",
       "           require(['jgraph'], function () {\n",
       "               var $d = $('#graph-78bded5d-4805-4fb6-99b1-9b68c070d94d');\n",
       "               $d.width(600); $d.height(400);\n",
       "               $d.jgraph = jQuery.extend({}, jgraph);\n",
       "               $d.jgraph.create($d, {nodeSize: 2.000000,\n",
       "                                     edgeSize: 0.250000,\n",
       "                                     defaultNodeColor: '0x5bc0de',\n",
       "                                     defaultEdgeColor: '0xaaaaaa',\n",
       "                                     shader: 'basic',\n",
       "                                     z: 100,\n",
       "                                     runOptimization: true,\n",
       "                                     directed: true,\n",
       "                                     showSave: false});\n",
       "               $d.jgraph.draw({\n",
       "    \"edges\": [\n",
       "        { \"source\": 11782, \"target\": 11785 },\n",
       "        { \"source\": 11783, \"target\": 11785 },\n",
       "        { \"source\": 11784, \"target\": 11785 },\n",
       "        { \"source\": 11784, \"target\": 11786 },\n",
       "        { \"source\": 11787, \"target\": 11786 }\n",
       "    ],\n",
       "    \"nodes\": {\n",
       "        \"11782\": { \"location\": [ -2.0, -2.0, -2.0 ] },\n",
       "        \"11783\": { \"location\": [ -2.0, -1.5447543579115544, -1.5886853872884035 ] },\n",
       "        \"11784\": { \"location\": [ -0.5428605683517916, -0.7184108288241228, -0.8405707447170225 ] },\n",
       "        \"11785\": { \"location\": [ 0.705822579666723, 1.0676865006680356, 0.7369379840103648 ] },\n",
       "        \"11786\": { \"location\": [ 1.5246196751786767, 1.6751947514193115, 1.7197540432845557 ] },\n",
       "        \"11787\": { \"location\": [ 2.0, 2.0, 2.0 ] }\n",
       "    }\n",
       "});\n",
       "\n",
       "               $d.resizable({\n",
       "                   aspectRatio: 600 / 400,\n",
       "                   resize: function (evt, ui) {\n",
       "                       $d.jgraph.renderer.setSize(ui.size.width,\n",
       "                                                  ui.size.height);\n",
       "                   }\n",
       "               });\n",
       "           });\n",
       "           </script>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "data = graph.run(\"MATCH (n)-->(m) RETURN ID(n), ID(m)\")\n",
    "data = [tuple(x) for x in data]\n",
    "\n",
    "jgraph.draw(data)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true,
    "deletable": true,
    "editable": true
   },
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true,
    "deletable": true,
    "editable": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "celltoolbar": "Slideshow",
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.5.2"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
