{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "# Neo4j configuration guide\n",
    "\n",
    "This notebook walks through basic code examples for integrating various packages with Neo4j, including `py2neo`, `ipython-cypher`, `pandas`, `neo4jupyter`, `networkx` and `jgraph`. It helps you configure Neo4j depending of your environment. "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "# Installation\n",
    "\n",
    "In case you are running Serenata de Amor using Docker, then you already have a Neo4j container up and running. However, if you are using Serenata de Amor outside Docker, you need to run **$ docker-compose up -d neo4j** to start the container.\n",
    "\n",
    "To stop it just run **$ docker-compose down neo4j**. The data stored in Neo4j will be stored in folder **serenata-de-amor-instalation-path/data/neo4j/data**.\n",
    "\n",
    "Now you gonna check installation. Jupyter and Neo4j integration is done using `py2neo` package. `py2neo` is one of Neo4j's Python drivers. It offers a fully-featured interface for interacting with your data in Neo4j."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "### Connecting\n",
    "\n",
    "To connect to Neo4j with the `Graph` class you need tell it what is Neo4j address. If you are running it from a traditional installation or as a Docker container, as described in CONTRIBUTING.MD, you can instantiate `Graph` class just like this:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "graph = Graph()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "or"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {
    "collapsed": true,
    "deletable": true,
    "editable": true
   },
   "outputs": [],
   "source": [
    "graph = Graph('http://localhost:7474')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "If you are using both serenata de amor and neo4j inside docker containers you need to instantiate the Graph object pointing to **http://neo4j:7474** like this:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Neo4j not found. Maybe it is not runnning inside a container...\n"
     ]
    }
   ],
   "source": [
    "try:\n",
    "    graph = Graph('http://neo4j:7474')\n",
    "except:\n",
    "    print('Neo4j not found. Maybe it is not runnning inside a container...')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "To delete the entire graph database just run:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {
    "collapsed": true,
    "deletable": true,
    "editable": true
   },
   "outputs": [],
   "source": [
    "graph.delete_all()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "# Using py2neo"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "## Nodes\n",
    "\n",
    "Create nodes with the `Node` class. The first argument is the node's label. The remaining arguments are an arbitrary amount of node properties or key-value pairs."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "collapsed": true,
    "deletable": true,
    "editable": true
   },
   "outputs": [],
   "source": [
    "from py2neo import Node\n",
    "\n",
    "nicole = Node(\"Person\", name=\"Nicole\", age=24)\n",
    "drew = Node(\"Person\", name=\"Drew\", age=20)\n",
    "\n",
    "mtdew = Node(\"Drink\", name=\"Mountain Dew\", calories=9000)\n",
    "cokezero = Node(\"Drink\", name=\"Coke Zero\", calories=0)\n",
    "\n",
    "coke = Node(\"Manufacturer\", name=\"Coca Cola\")\n",
    "pepsi = Node(\"Manufacturer\", name=\"Pepsi\")\n",
    "\n",
    "graph.create(nicole | drew | mtdew | cokezero | coke | pepsi)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "## Relationships\n",
    "\n",
    "Create relationships between nodes with the `Relationship` class."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [],
   "source": [
    "from py2neo import Relationship\n",
    "\n",
    "graph.create(Relationship(nicole, \"LIKES\", cokezero))\n",
    "graph.create(Relationship(nicole, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(drew, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(coke, \"MAKES\", cokezero))\n",
    "graph.create(Relationship(pepsi, \"MAKES\", mtdew))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "## Neo4jupyter\n",
    "\n",
    "`neo4jupyter` is a python package that helps in drawing graphs inside Jupyter notebooks.\n",
    "\n",
    "The first thing after import the package is run `neo4jupyter.init_notebook_mode()` in order to setup the required scripts."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [
    {
     "data": {
      "application/javascript": [
       "$(\"head\").append($(\"<link/>\").attr({\n",
       "  rel:  \"stylesheet\",\n",
       "  type: \"text/css\",\n",
       "  href: \"https://cdnjs.cloudflare.com/ajax/libs/vis/4.8.2/vis.css\"\n",
       "}));\n",
       "require.config({     paths: {         vis: '//cdnjs.cloudflare.com/ajax/libs/vis/4.8.2/vis.min'     } }); require(['vis'], function(vis) {  window.vis = vis; }); "
      ],
      "text/plain": [
       "<IPython.core.display.Javascript object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import neo4jupyter\n",
    "\n",
    "neo4jupyter.init_notebook_mode()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"7802e277-098f-484b-8aa1-eb43bc911438\" style=\"height: 400px;\"></div>\n",
       "\n",
       "<script type=\"text/javascript\">\n",
       "\n",
       "    var nodes = [{\"group\": \"Drink\", \"label\": \"Coke Zero\", \"id\": 5385, \"title\": \"{'name': 'Coke Zero', 'calories': 0}\"}, {\"group\": \"Manufacturer\", \"label\": \"Coca Cola\", \"id\": 5380, \"title\": \"{'name': 'Coca Cola'}\"}, {\"group\": \"Person\", \"label\": \"Nicole\", \"id\": 5382, \"title\": \"{'name': 'Nicole', 'age': 24}\"}, {\"group\": \"Drink\", \"label\": \"Mountain Dew\", \"id\": 5383, \"title\": \"{'name': 'Mountain Dew', 'calories': 9000}\"}, {\"group\": \"Manufacturer\", \"label\": \"Pepsi\", \"id\": 5381, \"title\": \"{'name': 'Pepsi'}\"}, {\"group\": \"Person\", \"label\": \"Drew\", \"id\": 5384, \"title\": \"{'name': 'Drew', 'age': 20}\"}];\n",
       "    var edges = [{\"to\": 5385, \"from\": 5380, \"label\": \"MAKES\"}, {\"to\": 5383, \"from\": 5382, \"label\": \"LIKES\"}, {\"to\": 5385, \"from\": 5382, \"label\": \"LIKES\"}, {\"to\": 5383, \"from\": 5381, \"label\": \"MAKES\"}, {\"to\": 5383, \"from\": 5384, \"label\": \"LIKES\"}];\n",
       "\n",
       "    var container = document.getElementById(\"7802e277-098f-484b-8aa1-eb43bc911438\");\n",
       "\n",
       "    var data = {\n",
       "        nodes: nodes,\n",
       "        edges: edges\n",
       "    };\n",
       "\n",
       "    var options = {\n",
       "    nodes: {\n",
       "        shape: 'dot',\n",
       "        size: 25,\n",
       "        font: {\n",
       "            size: 14\n",
       "        }\n",
       "    },\n",
       "    edges: {\n",
       "        font: {\n",
       "            size: 14,\n",
       "            align: 'middle'\n",
       "        },\n",
       "        color: 'gray',\n",
       "        arrows: {\n",
       "            to: {\n",
       "                enabled: true,\n",
       "                scaleFactor: 0.5\n",
       "            }\n",
       "        },\n",
       "        smooth: {\n",
       "            enabled: false\n",
       "        }\n",
       "    },\n",
       "    physics: {\n",
       "        enabled: true\n",
       "        }\n",
       "    };\n",
       "\n",
       "    var network = new vis.Network(container, data, options);\n",
       "\n",
       "</script>\n"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from neo4jupyter import draw\n",
    "\n",
    "options = {\"Person\": \"name\", \"Drink\": \"name\", \"Manufacturer\": \"name\"}\n",
    "draw(graph, options)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "## Cypher\n",
    "\n",
    "Retrieve Cypher query results with `Graph.run`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "('name': 'Nicole', 'drink': 'Mountain Dew')\n",
      "('name': 'Nicole', 'drink': 'Coke Zero')\n",
      "('name': 'Drew', 'drink': 'Mountain Dew')\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name AS name, drink.name AS drink\n",
    "\"\"\"\n",
    "\n",
    "data = graph.run(query)\n",
    "\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "## Parameterized Cypher\n",
    "\n",
    "Pass parameters to Cypher queries by passing additional key-value arguments to `Graph.run`. Parameters in Cypher are named and are wrapped in curly braces."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "('name': 'Nicole', 'avg_calories': 4500.0)\n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (p:Person)-[:LIKES]->(drink:Drink)\n",
    "WHERE p.name = {name}\n",
    "RETURN p.name AS name, AVG(drink.calories) AS avg_calories\n",
    "\"\"\"\n",
    "\n",
    "data = graph.run(query, name=\"Nicole\")\n",
    "\n",
    "for d in data:\n",
    "    print(d)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "# ipython-cypher\n",
    "\n",
    "`ipython-cypher` exposes `%cypher` magic in Jupyter. Install `ipython-cypher` with `pip install ipython-cypher`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {
    "collapsed": true,
    "deletable": true,
    "editable": true
   },
   "outputs": [],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "## Cypher\n",
    "\n",
    "`%cypher` is intended for one-line Cypher queries and `%%cypher` is intended for multi-line Cypher queries. Placing `%%cypher` above a Cypher query will display that query's results."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>person.name</th>\n",
       "        <th>drink.name</th>\n",
       "        <th>drink.calories</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Coke Zero</td>\n",
       "        <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Drew</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Nicole', 'Mountain Dew', 9000],\n",
       " ['Nicole', 'Coke Zero', 0],\n",
       " ['Drew', 'Mountain Dew', 9000]]"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name, drink.name, drink.calories"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "## Pandas Data Frames\n",
    "\n",
    "Cypher query results can be coerced to `pandas` data frames with the `get_dataframe` method. To assign Cypher query results to a variable, you need to use `%cypher` and separate lines with \\\\. You'll first need to install `pandas` with `pip install pandas`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>drink</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Coke Zero</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Drew</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     name         drink\n",
       "0  Nicole  Mountain Dew\n",
       "1  Nicole     Coke Zero\n",
       "2    Drew  Mountain Dew"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = %cypher MATCH (person:Person)-[:LIKES]->(drink:Drink) \\\n",
    "                  RETURN person.name AS name, drink.name AS drink\n",
    "    \n",
    "df = results.get_dataframe()\n",
    "\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "## NetworkX Graphs\n",
    "\n",
    "Cypher query results can be coerced to `NetworkX` MultiDiGraphs, graphs that permit multiple edges between nodes, with the `get_graph` method. You'll first need to install `NetworkX` with `pip install networkx`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/home/marcus/anaconda/envs/serenata_de_amor/lib/python3.5/site-packages/networkx/drawing/nx_pylab.py:126: MatplotlibDeprecationWarning: pyplot.hold is deprecated.\n",
      "    Future behavior will be consistent with the long-time default:\n",
      "    plot commands add elements without first clearing the\n",
      "    Axes and/or Figure.\n",
      "  b = plt.ishold()\n",
      "/home/marcus/anaconda/envs/serenata_de_amor/lib/python3.5/site-packages/networkx/drawing/nx_pylab.py:138: MatplotlibDeprecationWarning: pyplot.hold is deprecated.\n",
      "    Future behavior will be consistent with the long-time default:\n",
      "    plot commands add elements without first clearing the\n",
      "    Axes and/or Figure.\n",
      "  plt.hold(b)\n",
      "/home/marcus/anaconda/envs/serenata_de_amor/lib/python3.5/site-packages/matplotlib/__init__.py:917: UserWarning: axes.hold is deprecated. Please remove it from your matplotlibrc and/or style files.\n",
      "  warnings.warn(self.msg_depr_set % key)\n",
      "/home/marcus/anaconda/envs/serenata_de_amor/lib/python3.5/site-packages/matplotlib/rcsetup.py:152: UserWarning: axes.hold is deprecated, will be removed in 3.0\n",
      "  warnings.warn(\"axes.hold is deprecated, will be removed in 3.0\")\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAdwAAAFCCAYAAABbz2zGAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAIABJREFUeJzt3Xt8VOWB//FvAoFkCIQgkWBRoCBaFVBJwCBCqFwkEQiZ\nQxAQTqi3srvttn2xa93d3nbdsu760/a13bV9vWQ3h6BAmEkCQmK4mXAVgsAG9YWIFyiIDXIJBhIu\nyfz+mBJNkUuSyTlz+bz/y5wzD9/8wzfPM2eeJ8rn8/kEAADaVbTTAQAAiAQULgAANqBwAQCwAYUL\nAIANKFwAAGxA4QIAYAMKFwAAG1C4AADYgMIFAMAGFC4AADagcAEAsAGFCwCADShcAABsQOECAGAD\nChcAABtQuAAA2IDCBQDABhQuAAA2oHABALABhQsAgA0oXAAAbEDhAgBgAwoXAAAbULgAANiAwgUA\nwAYdnQ4AAEAz1dVSXp5UVSXV1EgJCdKQIdK8eVJSktPpWi3K5/P5nA4BAIAqK6WFC6XSUv/P9fVf\nXYuLk3w+adIk6bnnpNRUZzK2AYULAHDeK69ICxZIdXX+Yr2aqCh/+b74ojR/vn35AoAlZQCAsy6X\n7blz17/X5/Pft2CB/+cQKl1muAAA51RWSunpN1a2f8nlkioqpJSUgMdqDzylDABwzsKF/mXk1qir\n878/RDDDBQA4o7pa6tu3+cNRLRUbKx0+HBJPLzPDBQA4Iy+v7WNERQVmHBtQuAAAZ1RVtW12K/mX\nlfftC0yedkbhAgCcUVMTmHFOnQrMOO2MwgUAOCMhITDjJCYGZpx2xvdwAQC2Onv2rLxer+refltz\nJcW1ZbC4OGnw4AAla1/McAEA7a6xsVHl5eXKzc1Vnz59VFBQoN4//aliO3du28A+n5SbG5CM7Y0Z\nLgCg3Rw8eFCLFy/W4sWL1a1bN+Xm5urf/u3flJyc7L+hpEQqLr72do5XExUlZWSExFeCJL6HCwAI\nsJqaGhUUFMiyLB04cECzZs2SaZq69957FRUV1fzmCNppisIFALRZQ0OD1q9fL8uyVFJSoocfflim\naWrSpEmKiYm59ptbspfyZS5XyB1gQOECAFrt/fffl2VZWrJkiW655RaZpqmZM2fqpptuatlAEXBa\nEIULAGiREydOaNmyZbIsS0ePHtXjjz8u0zR11113tW3gXbv8eyOXlPiL9et7LF8+Dzcjw38ebogs\nI38dhQsAuK6LFy+qtLRUlmVpw4YNmjRpkkzT1Lhx49SxY4Cfvz1+3L9d4759/k0tEhP9X/3JzQ2Z\nB6S+CYULALiqvXv3yrIsvf7667r99ttlmqZycnKUEKhNKyIIXwsCADTzpz/9Sa+99posy9Lp06dl\nmqa2bt2qgQMHOh0tpDHDBQCovr5eb7zxhizL0pYtW5SVlSXTNDVmzBhFR7NHUiBQuAAQoXw+n3bu\n3CnLslRQUKChQ4fKNE1lZ2crPj7e6XhhhyVlAIgwR44cUX5+vhYvXqxLly7JNE2988476tu3r9PR\nwhozXACIAOfOnVNRUZEsy9KuXbs0ffp0maaptLS0K3d/QrugcAEgTPl8Pm3evFmWZamwsFAPPPCA\nTNPU1KlTFRfXpjN60AosKQNAmPnkk0+aDgyIi4uTaZp67733dMsttzgdLaJRuAAQBr788kutWLFC\nlmXp/fff12OPPably5dr2LBhLBkHCZaUASBENTQ06K233pJlWXrjjTeUnp4u0zSVmZmpTp06OR0P\nf4HCBYAQ88EHH8iyLOXn5yspKUm5ubmaOXOmkkJ428NIwJIyAISAU6dONR0YcOjQIc2ePVslJSUa\nPHiw09Fwg5jhAkCQunTpksrKymRZltauXauJEyfKNE1NmDAh8AcGoN1RuAAQZKqqqpoODOjXr59M\n09SMGTOUmJjodDS0AX8iAUAQOH78uF5//XVZlqUvvvhCc+bMUXl5ue644w6noyFAmOECgEMuXLig\n1atXy7IsVVRUaPLkyTJNU2PHjlWHDh2cjocAo3ABwEY+n0/vvPOOLMvSsmXLdPfdd8s0TRmGoa5d\nuzodD+2IJWUAsMFnn32mJUuWyLIs1dfXa+7cudq5c6f69+/vdDTYhBkuALSTuro6rVy5Unl5edqx\nY4fcbrdM09SoUaPY/SkCUbgAEEA+n0/btm2TZVnyeDxKSUlRbm6usrKy5HK5nI4HB7GkDAABcOjQ\noaYDAzp27CjTNFVVVaU+ffo4HQ1BgsIFgFaqra2V1+uVZVmqqqrSjBkz9Nprryk1NZUlY1yBJWUA\naIHGxkaVl5fLsiytXLlSDz30kEzT1OTJk9W5c2en4yGIUbgAcAM+/PDDpiXjxMREmaapWbNmqVev\nXk5HQ4hgSRkAruL06dMqKCiQZVk6ePCgZs2apZUrV+ree+91OhpCEDNcAPiahoYGrVu3TpZlqbS0\nVOPGjZNpmnrkkUcUExPjdDyEMAoXACS99957sixLS5YsUZ8+fWSaph577DHddNNNTkdDmGBJGUDE\nOnHihJYuXaq8vDwdO3ZMc+bM0YYNG/Sd73zH6WgIQ8xwAUSUixcvqqSkRJZlaePGjcrMzJRpmnr4\n4Yc5MADtisIFEPZ8Pp/27Nkjy7K0dOlS3XHHHTJNU9OnT1dCQoLT8RAhWFIGELY+//xzvfbaa7Is\nS19++aXmzp2r7du3a8CAAU5HQwRihgsgrNTX12vVqlWyLEvbtm1TVlaWTNPU6NGjFR0d7XQ8RDAK\nF0DIqa+v14EDBzRkyBBJ/iXjHTt2yLIsFRQU6L777pNpmsrOzlaXLl0cTgv4saQMICR8vVSXLVum\nzp07a9u2bVq2bJksy5LP55NpmtqzZ49uu+02p+MCV2CGCyCo/fGPf1R+fr4WL16sDz74oNm1+Ph4\nzZ49W6Zp6oEHHuDAAAQ1ChdA0Dl79qyKiopkWZY2bNigq/03NW3aNBUWFtqcDmgdlpQBBIXGxkZt\n3rxZlmVpxYoVqq2tveb9PXv21MCBA21KB7QdhQvAUR9//HHTKTyffPLJNe+NiYnRo48+KtM0NWnS\nJHXq1MmmlEDbUbgAbHfmzBmtWLFClmVp8+bN171/2LBhMk1TM2fOVM+ePW1ICAQehQvAFg0NDdq4\ncaMsy1JhYaHq6uqueX9ycrLmzJkj0zR1991325QSaD8ULoDmqqulvDypqkqqqZESEqQhQ6R586Sk\npBYPt3//flmWpfz8fB09evSa93bu3Llpo4rx48erY0f+i0L44CllAH6VldLChVJpqf/n+vqvrsXF\nST6fNGmS9NxzUmrqNYc6efKkli9fLsuytGPHjuv+0yNHjpRpmsrJyVH37t3b8lsAQYvCBSC98oq0\nYIFUV+cv1quJivKX74svSvPnN7t08eJFlZWVybIsrVq1ShcuXLjmP3nrrbdq7ty5mjt3rgYNGhSI\n3wIIaqzXAJHuctmeO3f9e30+/30LFvh/nj9fVVVVysvL02uvvabq6uprvt3lcskwDJmmqfT0dPY2\nRkRhhgtEsspKKT39xsr2L1yMiVFu//56/cCB696bnp6u3Nxcud1uxcfHtyIoEPooXCCSZWdLxcXX\nXka+igZJxZKMq1wfMGCATNPUnDlz1K9fvzaEBMIDhQtEqupqqW/f5g9HtVCdpNskffHnn7t166ac\nnBzl5uZq5MiR7G0MfA2f4QKRKi+vzUP4JOVK2jdxokzTVFZWluLi4to8LhCOKFwgUlVVtWl2K0ku\nSb9yu+XyeAKTCQhjPCIIRChfTU1AxnGdPx+QcYBwxwwXiCA+n0979+6Vx+PRiIoKTQnEoImJgRgF\nCHsULhDmfD6fKisr5fF45PV69fHHH0uSFkgaJ/+ycKvFxUmDBwcgJRD+eEoZCEONjY3avn27PB6P\nCgsLdfjw4SvuSZJ0SFKbHnGKjZUOH27VHstApGGGC4SJhoYGbd68WV6vV16vV8eOHbvm/ccllUVF\naYrP17qHOaKipIwMyha4QRQuEMIuXryo8vJyeb1eFRUVXXdrRcl/Is/EiRNlGIYe/ta3FD15cqt2\nmlJcnP8gAwA3hMIFQsyFCxe0fv16eb1eFRcX6+TJk9d9T1xcnDIyMmQYhjIzM9W1a9evLr744o3v\npXyZy+V/X0pKK34DIDJRuEAIqK+v19q1a+XxeLRq1SrV3MBXeuLj4/Xoo4/KMAw98sgj6tKlyzff\nePnUnzaeFgTg2nhoCghS586dU2lpqTwej1avXq3a2trrvqdbt26aOnWq3G63JkyY0LJdn3bt8p+H\nW1LiL9a6uq+uXT4PNyPDv4zMzBZoMQoXCCJffvml1qxZI4/Ho9LSUp27gWXeHj16aOrUqf7PZB9+\nWJ07d25biOPH/ds+7tsnnTrl/57t4MFSbi4PSAFtQOECDjt9+rTeeOMNeTwelZWV6fwN7NyUlJSk\nadOmyTAMpaenKyYmxoakANqCz3ABB5w4cUIrV66U1+vVunXrdPHixeu+Jzk5WW63W4Zh6KGHHlKH\nDh1sSAogUChcwCbV1dUqKiqS1+vVxo0b1dDQcN339OnTR4ZhyDAMpaWlKTqa7c+BUEXhAu3os88+\nU2FhobxerzZt2qTGxsbrvqd///4yDENut1upqamULBAmKFygHaxfv16//OUvtW3bNt3IYxK33367\npk+fLrfbrfvuu4+D24EwROEC7eDChQvaunXrNe+5++67mz6TveeeeyhZIMxRuECA+Hw+7dq1S16v\nVytWrFB0dPQVS8hDhw5tWi7+zne+41BSAE7ga0FAGzQ2NmrHjh1NR9916tSpaWn4t7/9rRYvXqyU\nlJSmkh04cKDTkQE4hMIFWqihoUFbt25tOvque/fuTYX69aXhgwcPqmPHjurXr5+zgQEEBQoXuAGX\nLl1SRUWFPB6PioqK1Lt3b7ndbpaGAdwwPsMFruLChQvauHGjPB6PVq5cqf79+8vtdmvLli0sDQNo\nMWa4wNfU19dr3bp1TQcG3HHHHTIMQ9nZ2SwNA2gTChcR79y5c3rzzTfl9XpVUlKiIUOGyDAMTZs2\nTX369HE6HoAwQeEiItXW1qqkpKTpwIDU1FQZhqGsrCwlJyc7HQ9AGKJwETFqamq0evVqeTwebdiw\nQQ8++KAMw9DUqVPVs2dPp+MBCHMULsLayZMntWrVKnk8Hm3atEnp6elyu92aMmWKEhMTnY4HIIJQ\nuAg7x48fV3FxsTwej95++209/PDDMgxDjz76qLp16+Z0PAARisJFWDh27JiKiork8Xi0e/duTZw4\nUYZhaNKkSYqPj3c6HgBQuAhdf/zjH1VYWCiPx6N3331XmZmZMgxDEydOVFxcnNPxAKAZChch5ZNP\nPpHX65XX69WBAwc0ZcoUGYahcePGqXPnzk7HA4CronAR9D788EN5vV55PB4dOnRI06ZNk2EYGjt2\nrGJiYpyOBwA3hMJFUHr//febSra6ulrZ2dlyu90aPXq0OnZkR1IAoYfCRVDw+Xzat2+fPB6PPB6P\nzpw503QCz8iRI9WhQwenIwJAm1C4cIzP59Pu3bubSvbSpUtyu90yDEPDhw9XdHS00xEBIGAoXNiq\nsbFRO3fubDqwvWPHjjIMQ4Zh6P777286SxYAwg0fhqHdNTQ0aNu2bU0Htnft2lWGYWjlypUaPHgw\nJQsgIlC4aBeXLl3Spk2b5PV6VVhYqJtvvlmGYaisrEx33XWX0/EAwHYULgLm4sWL2rhxo7xer4qL\ni3XbbbfJMAxt2rRJt99+u9PxAMBRFC7a5Pz581q3bp28Xq9WrVqlQYMGyTAM7dixQ/3793c6HgAE\nDR6aQovV1dWprKxMHo9Ha9as0T333CPDMJSdna1bb73V6XgAEJQoXNyQ2tpalZaWyuPx6M0339Sw\nYcNkGIamTZum3r17Ox0PAIIehYurOnPmTNOB7evXr1daWpoMw1BWVpaSkpKcjgcAIYXCRTOnTp1q\nOrC9oqJCo0ePlmEYmjJlinr06OF0PAAIWRQu9MUXX6i4uFher1dbt25tdmB7QkKC0/EAICxQuBHq\n888/V1FRkbxeryorKzVx4kS53W5lZGSoa9euTscDgLBD4UaQI0eOqLCwUF6vV//3f/+nzMxMud1u\nPfLII3K5XE7HA4CwRuGGuUOHDjUdc7d//35NnjxZhmFo/Pjxio2NdToeAEQMCjcMHTx4sKlkP/nk\nE2VlZckwDH33u99Vp06dnI4HABGJwg0T+/fvbzrm7tixY8rOzpZhGBozZgwHtgNAEKBwQ5TP59O7\n777bVLKnT59uOkv2wQcf5MB2AAgyFG4I8fl82rNnT9NZsvX19TIMQ263Ww888AAHtgNAEKNwg5zP\n52t2YHt0dHRTyaakpHCWLACECD7cC0KNjY3NDmx3uVwyDEOFhYUaOnQoJQsAIYjCDRINDQ3avHlz\nU8nedNNNMgxDpaWluuuuuyhZAAhxFK6DLl68qPLycnk8HhUVFalPnz4yDENvvfWW7rjjDqfjAQAC\niMK12fnz57VhwwZ5PB6tWrVKAwYMkGEYevvtt/Xtb3/b6XgAgHbCQ1OSVF0t5eVJVVVSTY2UkCAN\nGSLNmycF4Bi6uro6rV27Vh6PR6tXr9bdd9/ddGD7bbfd1vb8AICgF9mFW1kpLVwolZb6f66v/+pa\nXJzk80mTJknPPSelprZo6LNnzzY7sP2+++6T2+3WtGnT9K1vfSuAvwQAIBREbuG+8oq0YIFUV+cv\n1quJivKX74svSvPnX3PIM2fOaM2aNU0Hto8YMUJut1tZWVnq1atXgH8BAEAoiczCvVy2587d+Htc\nrm8s3dOnTzcd2F5eXq6HHnpIbrdbU6dO1U033RTg4ACAUBV5hVtZKaWnt6xsL3O5pIoKnejfXytX\nrpTH49GWLVs0duxYGYahyZMnq3v37gGPDAAIfZFXuNnZUnHxtZeRr6IxKkpbe/ZUZn29JkyYIMMw\nlJmZyYHtAIDriqzCra6W+vZt/nBUCzXExKj+wAF16dcvcLkAAGEvsna7z8tr8xAdOnZUlxUr2p4F\nABBRIqtwq6raNLuV5H+qed++wOQBAESMyCrcmprAjHPqVGDGAQBEjMgq3ISEwIyTmBiYcQAAESOy\nCnfIECk2tm1jxMVJgwcHJg8AIGLwlHJLxcZKhw8HZI9lAEDkiKwZ7s03+/dGbuXZsr6oKCkjg7IF\nALRYZBWu5D+IIC6uVW89Hx2t2h/8IMCBAACRIPIKNzXVvyeyy9Wit/lcLhU9+KDuf/ppvfvuu+0U\nDgAQriKvcCX/AQSXS/d6y8tRUZLLpagXX9TMigr90z/9k8aOHatly5bZkxUAEBYi66Gpv7Rrl/88\n3JISf7HW1X117fJ5uBkZ/mXolJSmS3v37pXb7daUKVP07//+74qJiXEgPAAglER24V52/Lh/28d9\n+/ybWiQm+r/6k5t71QekTp48qccff1y1tbUqKChQcnKyrZEBAKGFwm2DxsZG/fM//7NeffVVFRQU\naOTIkU5HAgAEKQo3ANasWaN58+bp5z//uf76r/9aUa382hEAIHxRuAHy0UcfKTs7W0OGDNEf/vAH\nuVr4FDQAILxF5lPK7WDAgAHavn27JCktLU0fffSRw4kAAMGEwg0gl8ulxYsX66mnnlJaWppWr17t\ndCQAQJBgSbmdbNu2TTk5OXriiSf0i1/8QtHR/G0DAJGMwm1Hn3/+uXJychQfH68lS5aoR48eTkcC\nADiEaVc7Sk5O1oYNG3TnnXcqJSVFe/fudToSAMAhFG47i4mJ0UsvvaRf//rXGj9+vBYvXux0JACA\nA1hSttG7776r7OxsjR8/Xi+//LI6derkdCQAgE2Y4dronnvuUWVlpY4ePaoxY8bo6NGjTkcCANiE\nwrVZQkKCCgsLNXnyZKWmpqq8vNzpSAAAG7Ck7KC1a9dq7ty5+ru/+zv95Cc/YUtIAAhjFK7DDh06\nJLfbrQEDBmjRokWKj493OhIAoB2wpOywvn37asuWLYqPj9fw4cP1wQcfOB0JANAOKNwgEBsbq0WL\nFunHP/6xRo0apaKiIqcjAQACjCXlILNz505Nnz5ds2bN0r/8y7+oY8eOTkcCAAQAhRuEjh8/rpkz\nZ0qSli5dqqSkJIcTAQDaiiXlIJSUlKQ333xTKSkpSklJUWVlpdORAABtxAw3yBUWFuqZZ57Rr3/9\naz311FNOxwEAtBKFGwL279+v7OxsjRw5Ur/73e8UGxvrdCQAQAuxpBwC7rzzTu3YsUNnzpzRqFGj\ndOjQIacjAQBaiMINEV27dtXy5cs1c+ZMjRgxQuvWrXM6EgCgBVhSDkHl5eWaOXOmfvjDH+rZZ59V\ndDR/NwFAsKNwQ9SRI0c0ffp09erVS5ZlKSEhwelIAIBrYGoUovr06aPy8nLdcsstGj58uN577z2n\nIwEAroHCDWGdO3fWf//3f+sf/uEflJ6eruXLlzsdCQBwFSwph4k9e/bI7XYrKytLL7zwgmJiYpyO\nBAD4Ggo3jJw8eVKzZ8/WuXPntHz5ciUnJzsdCQDwZywph5EePXpo9erVSk9PV0pKirZt2+Z0JADA\nnzHDDVOrV6/W9773Pf3iF7/QX/3VXykqKsrpSAAQ0SjcMHbw4EG53W4NGTJEf/jDH+RyuZyOBAAR\niyXlMDZw4EBt375dPp9PaWlp+uijj5yOBAARi8INcy6XS/n5+XryySeVlpamNWvWOB0JACISS8oR\nZOvWrZoxY4aefPJJ/fznP2dLSACwEYUbYT7//HPl5OSoa9euys/PV48ePZyOBAARgSlOhElOTtaG\nDRs0aNAgpaamau/evU5HAoCIQOFGoJiYGL388st6/vnnNX78eC1evNjpSAAQ9lhSjnD79u1Tdna2\nJkyYoJdfflmdOnVyOhIAhCVmuBFu8ODB2rVrl44cOaL09HQdPXrU6UgAEJYoXCghIUFFRUV69NFH\nlZqaqoqKCqcjAUDYYUkZzaxdu1Zz587V3//93+vHP/4xW0ICQIBQuLjCp59+KrfbrYEDB2rRokWK\nj493OhIAhDyWlHGFfv36acuWLerSpYtGjBihDz74wOlIABDyKFx8o7i4OC1atEg/+tGPNGrUKBUV\nFTkdCQBCGkvKuK6dO3dq+vTpmjVrlp5//nl16NDB6UgAEHIoXNyQ48eP67HHHlN0dLSWLl2qnj17\nOh0JAEIKS8q4IUlJSSorK9P999+vYcOGqbKy0ulIABBSmOGixbxer77//e9r4cKFevLJJ52OAwAh\ngcJFq+zfv1/Tpk3Tgw8+qN/97neKjY11OhIABDWWlNEqd955p3bu3Kmamho99NBDOnTokNORACCo\nUbhota5du6qgoEAzZszQiBEjtH79eqcjAUDQYkkZAfHWW29p1qxZ+tu//Vs9++yzbAkJAH+BwkXA\nHDlyRIZhqHfv3srLy1NCQoLTkQAgaLCkjIDp06ePKioqlJycrOHDh+u9995zOhIABA0KFwHVuXNn\nvfLKK3ruueeUnp6u5cuXOx0JAIICS8poN3v27JHb7VZWVpZeeOEFxcTEOB0JABxD4aJdnTx5UrNn\nz1ZdXZ2WL1+uXr16OR0JABzBkjLaVY8ePbR69WqNHj1aKSkp2r59u9ORAMARzHBhmzfeeENPPPGE\nfvnLX2r+/Pl8dQhARKFwYauDBw8qOztb9957r37/+9/L5XI5HQkAbMGSMmw1cOBAbd++XQ0NDRo5\ncqQ+/vhjpyMBgC0oXNiuS5cuWrJkiZ544gmlpaWppKTE6UgA0O5YUoajtmzZohkzZujpp5/Wz372\nM0VH8zcggPBE4cJxx44dU05Ojrp166YlS5YoMTHR6UgAEHBMJ+C43r17a+PGjbr99tuVkpKivXv3\nOh0JAAKOwkVQiImJ0W9+8xs9//zzGj9+vPLz852OBAABxZIygs6+ffuUnZ2tiRMn6qWXXlKnTp2c\njgQAbcYMF0Fn8ODBqqys1OHDh5Wenq6jR486HQkA2ozCRVDq3r27iouLlZmZqdTUVFVUVDgdCQDa\nhCVlBL2ysjLNnTtXP/3pT/WjH/2ILSEBhCQKFyHh008/VXZ2tgYNGqRXX31V8fHxTkcCgBZhSRkh\noV+/ftq6datcLpceeOABHThwwOlIANAiFC5CRlxcnBYtWqQf/vCHGjVqlIqLiyVJtbW1Onv2rMPp\nAODaWFJGSNq5c6cMw9Ds2bP14Ycf6sCBAyosLNTAgQOdjgYA34jCRciqrq7WyJEj9dFHH0mSEhIS\nlJ+fr8mTJzucDACuxJIyQtaHH36oTz/9tOnnmpoaTZkyRT/72c/U0NDgXDAA+AYULkLW0KFDZRjG\nFa8///zzyszM1MmTJx1IBQDfjMJFyIqPj9fSpUv18ssvq0OHDs2ulZWVadiwYdq9e7dD6QCgOT7D\nRVjYtGmTcnJy9Kc//anZ67GxsXrllVeUm5vrTDAA+DNmuAgLo0eP1u7duzVy5Mhmr9fX12vevHma\nP3++zp8/71A6AKBwEUZuueUWvfXWW/qbv/mbK679/ve/15gxY3TkyBEHkgEAS8oIU0uWLNHTTz+t\nurq6Zq8nJSVp+fLlGjt2rEPJAEQqZrgIS48//ri2b9+ub3/7281eP378uMaNG6f/+I//EH9rArAT\nM1yEtVOnTmnOnDlas2bNFdcMw9D//M//qGvXrg4kAxBpmOEirCUmJmrVqlX61a9+dcWxfh6PR8OH\nD9f+/fsdSgcgkjDDRcQoKSnR7Nmzdfr06Wavx8fHKy8vT26326FkACIBM1xEjIyMDL3zzjsaOnRo\ns9dra2tlGIaeffZZXbp0yaF0AMIdM1xEnHPnzun73/++8vPzr7j23e9+V0uXLtXNN9/sQDIA4YwZ\nLiKOy+WSZVn6r//6L8XExDS7tnHjRg0bNkw7d+50KB2AcMUMFxFt+/btMgxDn332WbPXO3XqpP/8\nz//UU089dcXDVgDQGsxwEdHS0tK0e/dujRkzptnrFy5c0DPPPKMnnnjiis0zAKA1KFxEvF69emnd\nunX6yU9+csW1//3f/9WoUaOanbsLAK3BkjLwNQUFBfre976ns2fPNnu9R48eWrp0qSZMmOBQMgCh\njhku8DVbLLeoAAADB0lEQVQ5OTnasWOHBg0a1Oz1kydP6pFHHtG//uu/qrGx0aF0AEIZM1zgG9TU\n1Cg3N1fFxcVXXJsyZYosy1L37t2/erG6WsrLk6qqpJoaKSFBGjJEmjdPSkqyLziAoEXhAlfh8/n0\nwgsv6B//8R+vmNUOHDhQRUVFuqeuTlq4UCot9V+or//qprg4yeeTJk2SnntOSk21MT2AYEPhAtex\nfv16PfbYYzpx4kSz138QE6OXoqLU8eJFf7FeTVSUv3xffFGaP7+d0wIIVhQucAMOHz4st9utXbt2\nSZKekfT/JHVpySAuF6ULRDAKF7hB9fX1+sEPfqC9r76qcrWwbC9zuaSKCiklJbDhAAQ9ChdooU/v\nv1+37tmjDq15c1SUNG2a5PUGOhaAIEfhAi1RXS317dv84aiWio2VDh/m6WUgwvA9XKAl8vLaPkZU\nVGDGARBSKFygJaqq2ja7laS6OmnfvsDkARAyKFygJWpqAjPOqVOBGQdAyKBwgZZISAjMOImJgRkH\nQMigcIGWGDLE/9BTW8TFSYMHByYPgJDBU8pAS/CUMoBWYoYLtMTNN/v3Ro6Kat37o6KkjAzKFohA\nzHCBlqqslNLTpXPnWv5edpoCIhYzXKClUlP9eyK7XC173+W9lClbICJ1dDoAEJIuH0CwYIH/e7Wc\nFgTgOlhSBtpi1y7/ebglJf5irav76trl83AzMvzn4TKzBSIahQsEwvHj/u0a9+3zb2qRmOj/6k9u\nLg9IAZBE4QIAYAsemgIAwAYULgAANqBwAQCwAYULAIANKFwAAGxA4QIAYAMKFwAAG1C4AADYgMIF\nAMAGFC4AADagcAEAsAGFCwCADShcAABsQOECAGADChcAABtQuAAA2IDCBQDABhQuAAA2oHABALAB\nhQsAgA0oXAAAbEDhAgBgAwoXAAAbULgAANiAwgUAwAYULgAANqBwAQCwAYULAIANKFwAAGxA4QIA\nYAMKFwAAG1C4AADYgMIFAMAGFC4AADagcAEAsAGFCwCADShcAABsQOECAGCD/w9PeGECRUzR5wAA\nAABJRU5ErkJggg==\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x7ff407851b70>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import networkx as nx\n",
    "%matplotlib inline\n",
    "\n",
    "results = %cypher MATCH p = (:Person)-[:LIKES]->(:Drink) RETURN p\n",
    "\n",
    "g = results.get_graph()\n",
    "\n",
    "nx.draw(g)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('5382', {'age': 24, 'labels': ['Person'], 'name': 'Nicole'}),\n",
       " ('5385', {'calories': 0, 'labels': ['Drink'], 'name': 'Coke Zero'}),\n",
       " ('5383', {'calories': 9000, 'labels': ['Drink'], 'name': 'Mountain Dew'}),\n",
       " ('5384', {'age': 20, 'labels': ['Person'], 'name': 'Drew'})]"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.nodes(data=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'5382': 2, '5383': 2, '5384': 1, '5385': 1}"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nx.degree(g)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "deletable": true,
    "editable": true
   },
   "source": [
    "# jgraph\n",
    "\n",
    "`jgraph` will plot tuple lists as 3D graphs."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {
    "collapsed": false,
    "deletable": true,
    "editable": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"graph-2f80a38c-9fdd-4952-b7b2-e92c16bcd2f4\"></div>\n",
       "           <script type=\"text/javascript\">\n",
       "           require.config({baseUrl: '/',\n",
       "                             paths: {jgraph: ['nbextensions/jgraph.min', 'https://rawgit.com/patrickfuller/jgraph/master/js/build/jgraph.min']}});\n",
       "           require(['jgraph'], function () {\n",
       "               var $d = $('#graph-2f80a38c-9fdd-4952-b7b2-e92c16bcd2f4');\n",
       "               $d.width(600); $d.height(400);\n",
       "               $d.jgraph = jQuery.extend({}, jgraph);\n",
       "               $d.jgraph.create($d, {nodeSize: 2.000000,\n",
       "                                     edgeSize: 0.250000,\n",
       "                                     defaultNodeColor: '0x5bc0de',\n",
       "                                     defaultEdgeColor: '0xaaaaaa',\n",
       "                                     shader: 'basic',\n",
       "                                     z: 100,\n",
       "                                     runOptimization: true,\n",
       "                                     directed: true,\n",
       "                                     showSave: false});\n",
       "               $d.jgraph.draw({\n",
       "    \"edges\": [\n",
       "        { \"source\": 1, \"target\": 2 },\n",
       "        { \"source\": 2, \"target\": 3 },\n",
       "        { \"source\": 3, \"target\": 4 },\n",
       "        { \"source\": 4, \"target\": 1 },\n",
       "        { \"source\": 4, \"target\": 5 },\n",
       "        { \"source\": 5, \"target\": 2 }\n",
       "    ],\n",
       "    \"nodes\": {\n",
       "        \"1\": { \"location\": [ -2.0, -2.0, -2.0 ] },\n",
       "        \"2\": { \"location\": [ -0.8165495088562379, -0.8026883266093943, -1.2093406029180387 ] },\n",
       "        \"3\": { \"location\": [ 0.22066382375024252, 0.20050223315744384, 0.0859614655768002 ] },\n",
       "        \"4\": { \"location\": [ 0.8178082913071398, 1.239958375040619, 1.0135715016166258 ] },\n",
       "        \"5\": { \"location\": [ 2.0, 1.7941498866444465, 2.0 ] }\n",
       "    }\n",
       "});\n",
       "\n",
       "               $d.resizable({\n",
       "                   aspectRatio: 600 / 400,\n",
       "                   resize: function (evt, ui) {\n",
       "                       $d.jgraph.renderer.setSize(ui.size.width,\n",
       "                                                  ui.size.height);\n",
       "                   }\n",
       "               });\n",
       "           });\n",
       "           </script>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import jgraph\n",
    "\n",
    "jgraph.draw([(1, 2), (2, 3), (3, 4), (4, 1), (4, 5), (5, 2)])"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python [conda env:serenata_de_amor]",
   "language": "python",
   "name": "conda-env-serenata_de_amor-py"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.5.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
